[
  {
    "start": "24 November 2025",
    "end": "27 November 2025",
    "strongest": "26 November 2025",
    "aspect": "Transiting Mars is Sextile your Natal Pluto",
    "description": "During this transit, you may dare to transform something about yourself; your appearance, personal surroundings or your relationship with another or group of people. You can achieve results now through perseverance and persistence."
  },
  {
    "start": "25 November 2025",
    "end": "27 November 2025",
    "strongest": "26 November 2025",
    "aspect": "Transiting Venus is Trine Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "26 November 2025",
    "end": "27 November 2025",
    "strongest": "26 November 2025",
    "aspect": "Transiting Venus is Trine Transiting Saturn",
    "description": "This can be a good time to re-define responsibilities and boundary lines in personal relationships. The head rules the heart and common sense prevails in romance. Serious or practical art forms."
  },
  {
    "start": "29 November 2025",
    "end": "30 November 2025",
    "strongest": "30 November 2025",
    "aspect": "Transiting Venus is Opposition Transiting Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "29 November 2025",
    "end": "1 December 2025",
    "strongest": "30 November 2025",
    "aspect": "Transiting Venus is Trine Transiting Neptune",
    "description": "This combination can increase the receptivity to beauty, art and music. The finer things in life appeal now, and creative or artistic imagination and inspiration are likely to be enhanced."
  },
  {
    "start": "30 November 2025",
    "end": "1 December 2025",
    "strongest": "1 December 2025",
    "aspect": "Transiting Venus is Square your Natal Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty now. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed."
  },
  {
    "start": "30 November 2025",
    "end": "3 December 2025",
    "strongest": "1 December 2025",
    "aspect": "Transiting Mars is Conjunct your Natal Mercury",
    "description": "There is a danger of hasty words or actions during this transit. It is imperative that you think before you open your mouth or make important decisions. Arguments are likely."
  },
  {
    "start": "30 November 2025",
    "end": "2 December 2025",
    "strongest": "1 December 2025",
    "aspect": "Transiting Venus is Conjunct your Natal Ascendant",
    "description": "You look and feel good about yourself now. You have the power to draw others to you and to make a good impression on people."
  },
  {
    "start": "30 November 2025",
    "end": "2 December 2025",
    "strongest": "1 December 2025",
    "aspect": "Transiting Venus is Conjunct your Natal Sun",
    "description": "This is an excellent time for allowing some beauty and culture into your life. Social occasions are enjoyable now. Love could be in the air too."
  },
  {
    "start": "1 December 2025",
    "end": "3 December 2025",
    "strongest": "2 December 2025",
    "aspect": "Transiting Venus is Sextile Transiting Pluto",
    "description": "Becoming aware of hidden attractions. Being drawn to another as if by some kind of inner compulsion. Intensification of passion."
  },
  {
    "start": "4 December 2025",
    "end": "4 December 2025",
    "strongest": "4 December 2025",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "5 December 2025",
    "end": "7 December 2025",
    "strongest": "6 December 2025",
    "aspect": "Transiting Mercury is Trine Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "6 December 2025",
    "end": "8 December 2025",
    "strongest": "7 December 2025",
    "aspect": "Transiting Mercury is Trine Transiting Saturn",
    "description": "This is an excellent time for setting up a time-in-motion study. Tedious tasks won't seem so tedious now. Concentration is good and thinking is practical and realistic."
  },
  {
    "start": "7 December 2025",
    "end": "8 December 2025",
    "strongest": "8 December 2025",
    "aspect": "Transiting Venus is Trine your Natal Mars",
    "description": "You are in the mood for fun at the moment. Be socially spontaneous. A night out could be just what you need to relax."
  },
  {
    "start": "7 December 2025",
    "end": "10 December 2025",
    "strongest": "9 December 2025",
    "aspect": "Transiting Mars is Square Transiting Saturn",
    "description": "The power of endurance. Progressing at the rate of two steps forward and one step backward; like driving with the handbrake on. A risk of accidents or injuries. Illness. Acts of violence. War-like behaviour. Destructiveness. Separations and losses."
  },
  {
    "start": "9 December 2025",
    "end": "11 December 2025",
    "strongest": "10 December 2025",
    "aspect": "Transiting Mercury is Opposition Transiting Uranus",
    "description": "Expressing either original or eccentric ideas. May be difficulties appreciating another's point of view, due to rigid or inflexible thinking. Easy excitability and nervous tension. Breakdowns in communication or transport are possible."
  },
  {
    "start": "10 December 2025",
    "end": "12 December 2025",
    "strongest": "11 December 2025",
    "aspect": "Transiting Mercury is Trine Transiting Neptune",
    "description": "A somewhat dreamy and romantic outlook. Power of presentiment. Inspired thinking. Artistic appreciation. Music, poetry, film and artistic creativity can flourish."
  },
  {
    "start": "11 December 2025",
    "end": "12 December 2025",
    "strongest": "12 December 2025",
    "aspect": "Transiting Mercury is Square your Natal Saturn",
    "description": "Your thinking and decision making processes tend to be slower than usual during this period. Your mind is occupied with serious or important matters. There can be miscommunications with others or transport problems and delays now."
  },
  {
    "start": "11 December 2025",
    "end": "12 December 2025",
    "strongest": "12 December 2025",
    "aspect": "Transiting Venus is Square your Natal Midheaven",
    "description": "Now is a perfect time for home decorating or entertaining. Family and domestic relationships should be good during this transit. Any areas of discord within the home or family can be dealt with now."
  },
  {
    "start": "11 December 2025",
    "end": "13 December 2025",
    "strongest": "12 December 2025",
    "aspect": "Transiting Mercury is Conjunct your Natal Ascendant",
    "description": "Intellectually, you are quite sharp and alert now. You have strong views and opinions, which may contrast with others causing the likelihood of arguments or lively debates."
  },
  {
    "start": "11 December 2025",
    "end": "13 December 2025",
    "strongest": "12 December 2025",
    "aspect": "Transiting Mercury is Conjunct your Natal Sun",
    "description": "Intellectual work is well-aspected now. Your mind is active and creative. It is a good time to catch up with any personal correspondences or communications."
  },
  {
    "start": "12 December 2025",
    "end": "13 December 2025",
    "strongest": "13 December 2025",
    "aspect": "Transiting Venus is Conjunct your Natal Neptune",
    "description": "This is a wonderful combination for romance or artistic creativity. Alternatively, the company of good friends in pleasant surroundings can be just as enjoyable."
  },
  {
    "start": "12 December 2025",
    "end": "14 December 2025",
    "strongest": "13 December 2025",
    "aspect": "Transiting Venus is Sextile your Natal Pluto",
    "description": "This transit can make you aware of subtle undercurrents and possible attraction between you and another. Acknowledge any feelings you may have, but avoid trying to manipulate situations."
  },
  {
    "start": "12 December 2025",
    "end": "14 December 2025",
    "strongest": "13 December 2025",
    "aspect": "Transiting Mercury is Sextile Transiting Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Sharp thinking and keen judgement. A critical mind. The power of persuasion."
  },
  {
    "start": "13 December 2025",
    "end": "15 December 2025",
    "strongest": "14 December 2025",
    "aspect": "Transiting Mars is Square Transiting Neptune",
    "description": "Fluctuating energy levels, with a tendency to feel washed out or physically depleted. Wanting something but not feeling inclined to make the necessary effort. The urge to escape. Fluctuating energies or a lack of drive. A weak will or character. A danger of being a pushover. A risk of illness and infection. Danger from inflammable substances."
  },
  {
    "start": "14 December 2025",
    "end": "16 December 2025",
    "strongest": "15 December 2025",
    "aspect": "Transiting Mars is Trine your Natal Saturn",
    "description": "Hard work and long hours don't faze you now. In fact, you relish the idea of carrying a task or project through to a successful conclusion."
  },
  {
    "start": "15 December 2025",
    "end": "17 December 2025",
    "strongest": "16 December 2025",
    "aspect": "Transiting Venus is Conjunct your Natal Mercury",
    "description": "A sense of humour and optimism should be apparent now. The world, in general, looks bright and cheerful. Love thoughts are likely to occupy your mind and, if you have artistic ability you can expect to feel inspired. Communications are easy now."
  },
  {
    "start": "18 December 2025",
    "end": "19 December 2025",
    "strongest": "18 December 2025",
    "aspect": "Transiting Mercury is Trine your Natal Mars",
    "description": "During this period, you are intellectually sharp and able to talk yourself into and out of just about anything now. You can get things done now if you put mind to it."
  },
  {
    "start": "19 December 2025",
    "end": "22 December 2025",
    "strongest": "20 December 2025",
    "aspect": "Transiting Mars is Trine your Natal Moon",
    "description": "Allow your instincts to guide you in your actions during this period, and trust them when assessing the actions of others. This is a good time for doing things around the home or with your family."
  },
  {
    "start": "20 December 2025",
    "end": "20 December 2025",
    "strongest": "20 December 2025",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "20 December 2025",
    "end": "22 December 2025",
    "strongest": "21 December 2025",
    "aspect": "Transiting Mars is Opposition your Natal Jupiter",
    "description": "You have the urge to live a full and active life now, coupled with the motivation to get successful results in your enterprises. You are competitive and confident in your ability to succeed. Negatively, there can be impatience or rashness, conflicts with others and accidents. There can also be financial or travel problems."
  },
  {
    "start": "20 December 2025",
    "end": "22 December 2025",
    "strongest": "21 December 2025",
    "aspect": "Transiting Venus is Square Transiting Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed. An emotional separation is possible."
  },
  {
    "start": "21 December 2025",
    "end": "23 December 2025",
    "strongest": "22 December 2025",
    "aspect": "Transiting Mercury is Square your Natal Midheaven",
    "description": "During this transit, your thoughts will simultaneously be on matters concerning your home and family and your career."
  },
  {
    "start": "22 December 2025",
    "end": "23 December 2025",
    "strongest": "23 December 2025",
    "aspect": "Transiting Mercury is Conjunct your Natal Neptune",
    "description": "There is no-one that can fool you like you can fool yourself during this transit. Guard against self-deception and misinterpreting the ideas and words of others. This is not your best time for making important decisions."
  },
  {
    "start": "22 December 2025",
    "end": "24 December 2025",
    "strongest": "23 December 2025",
    "aspect": "Transiting Mercury is Sextile your Natal Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Release information on \"a need to know basis\" when dealing with others."
  },
  {
    "start": "23 December 2025",
    "end": "25 December 2025",
    "strongest": "24 December 2025",
    "aspect": "Transiting Venus is Square Transiting Neptune",
    "description": "Unrealistic notions of love may cloud rational thinking during this period. There is a risk of being misunderstood, or of having romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "24 December 2025",
    "end": "25 December 2025",
    "strongest": "24 December 2025",
    "aspect": "Transiting Venus is Trine your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "25 December 2025",
    "end": "26 December 2025",
    "strongest": "26 December 2025",
    "aspect": "Transiting Mercury is Conjunct your Natal Mercury",
    "description": "This is a good time for making decisions and discussing issues of personal importance; however if transiting Mercury is going retrograde you need to exercise extra caution and circumspection before making important decisions. You are intellectually alert and bursting with new ideas at the moment."
  },
  {
    "start": "27 December 2025",
    "end": "28 December 2025",
    "strongest": "28 December 2025",
    "aspect": "Transiting Venus is Trine your Natal Moon",
    "description": "This transit can create an agreeable and gentle atmosphere. Others seem more receptive to your emotional needs. Social activity within the home or with the family is easy and relaxing."
  },
  {
    "start": "27 December 2025",
    "end": "29 December 2025",
    "strongest": "28 December 2025",
    "aspect": "Transiting Venus is Opposition your Natal Jupiter",
    "description": "Party time! The desire to socialise and to indulge the senses is accentuated now. Just don't overdo it, because your body won't thank you afterwards. Self-indulgent tendencies are strong now. Travelling during this transit may not be enjoyable."
  },
  {
    "start": "29 December 2025",
    "end": "30 December 2025",
    "strongest": "30 December 2025",
    "aspect": "Transiting Mercury is Square Transiting Saturn",
    "description": "Serious and realistic thinking applies now, which at its best is practical, but at its worst, narrow and pessimistic. There can be miscommunications during this planetary influence, or transport problems and delays."
  },
  {
    "start": "30 December 2025",
    "end": "12 March 2026",
    "strongest": "12 February 2026",
    "aspect": "Transiting Neptune is Trine your Natal Ascendant",
    "description": "During this period, your imagination and sensitivity are heightened, which may inspire you to explore or develop any artistic or creative potential you have. You will probably also have interests in spiritual and mystical matters at this time. Periods in retreat or in natural surroundings will be soothing and emotionally uplifting now. This can also be a good time for travel."
  },
  {
    "start": "31 December 2025",
    "end": "3 January 2026",
    "strongest": "1 January 2026",
    "aspect": "Transiting Mars is Sextile your Natal Uranus",
    "description": "This transit can inspire you to try something new or out the ordinary. It increases your courage to experiment or to introduce reforms. You can make changes now."
  },
  {
    "start": "31 December 2025",
    "end": "2 January 2026",
    "strongest": "1 January 2026",
    "aspect": "Transiting Mercury is Square Transiting Neptune",
    "description": "The use of imagination. Thinking one thing and saying another. Misinterpreting things. Being at risk from deception or misrepresentation of facts. Need guard to against being exposed to lies or misunderstandings. Miscommunications. Faulty judgement. Unrealistic ideas."
  },
  {
    "start": "1 January 2026",
    "end": "2 January 2026",
    "strongest": "2 January 2026",
    "aspect": "Transiting Mercury is Trine your Natal Saturn",
    "description": "This is a good time for attending to practical matters. You are able to plan well and to make arrangements. Your thinking is considered and realistic."
  },
  {
    "start": "1 January 2026",
    "end": "4 January 2026",
    "strongest": "3 January 2026",
    "aspect": "Transiting Mars is Trine your Natal Midheaven",
    "description": "You have increased self-motivation now, coupled with a definite sense of what you want to accomplish, be it on the home-front or in the professional area. The support of others is likely, as they recognise that you're clear about what you want to achieve."
  },
  {
    "start": "3 January 2026",
    "end": "3 January 2026",
    "strongest": "3 January 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "3 January 2026",
    "end": "5 January 2026",
    "strongest": "4 January 2026",
    "aspect": "Transiting Venus is Sextile your Natal Uranus",
    "description": "You are attracted to the idea of doing something different and exciting at the moment. It is a good time for snapping out of old patterns and routines. Perhaps a mild flirtation could give you a moment to remember?"
  },
  {
    "start": "3 January 2026",
    "end": "6 January 2026",
    "strongest": "5 January 2026",
    "aspect": "Transiting Mars is Square your Natal Pluto",
    "description": "You feel driven and compelled to achieve a lot now; however there is a real danger of over-estimating your physical drives and running yourself ragged. You may act territorially and aggressively towards others and experience intense power struggles. There is also a danger of accidents or injuries."
  },
  {
    "start": "3 January 2026",
    "end": "5 January 2026",
    "strongest": "4 January 2026",
    "aspect": "Transiting Mercury is Trine your Natal Moon",
    "description": "You are more in touch with your own and others' feelings now. If you have anything on your mind you're unsure about, you should be able to find good listeners and advisers during this transit. This is a good decision making period."
  },
  {
    "start": "4 January 2026",
    "end": "5 January 2026",
    "strongest": "5 January 2026",
    "aspect": "Transiting Venus is Trine your Natal Midheaven",
    "description": "You are receptive to the finer things in life at the moment. If you are artistic, your creative powers may be enhanced now. Professional and domestic circumstances are harmonious now."
  },
  {
    "start": "4 January 2026",
    "end": "5 January 2026",
    "strongest": "4 January 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Jupiter",
    "description": "This can be a good time for discussing important issues, as long as you keep everything in perspective and don't exaggerate or blow things out of proportion. Avoid hasty decisions."
  },
  {
    "start": "4 January 2026",
    "end": "7 January 2026",
    "strongest": "5 January 2026",
    "aspect": "Transiting Mars is Sextile your Natal Venus",
    "description": "This is a good time for making social contacts or entertaining. You have the energy and enthusiasm for socialising. Creative activity or romance is well-aspected now."
  },
  {
    "start": "5 January 2026",
    "end": "7 January 2026",
    "strongest": "6 January 2026",
    "aspect": "Transiting Venus is Square your Natal Pluto",
    "description": "At this time, there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Conflicts or power struggles in love are possible."
  },
  {
    "start": "5 January 2026",
    "end": "7 January 2026",
    "strongest": "6 January 2026",
    "aspect": "Transiting Venus is Sextile your Natal Venus",
    "description": "There is a pleasant and relaxing quality to this period. You are more receptive to others now and people find you easy-going and approachable. Social get-togethers work well now. You may like to surround yourself with beauty or mix with artistic people."
  },
  {
    "start": "6 January 2026",
    "end": "10 January 2026",
    "strongest": "8 January 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Mars",
    "description": "During this period passions run hot and feelings between people are intense and unpredictable. Acts of violence are possible due to heated emotions. (A love of war-like activity)."
  },
  {
    "start": "9 January 2026",
    "end": "10 January 2026",
    "strongest": "9 January 2026",
    "aspect": "Transiting Venus is Opposition Transiting Jupiter",
    "description": "Party time! The desire to socialise and to indulge the senses is accentuated now. However, there can be a tendency to over-indulgence and excess. Physical discomfort from too much of the 'good life'. Insincerity in love and affection can lead to hurts and slights."
  },
  {
    "start": "9 January 2026",
    "end": "11 January 2026",
    "strongest": "10 January 2026",
    "aspect": "Transiting Mars is Opposition Transiting Jupiter",
    "description": "Having the urge to live a full and busy life and to get successful results from actions taken. Competitive and motivated to succeed. Conflicts are possible over matters of outlook or religion. Legal, business or relationship disputes. Exaggerated actions or reactions."
  },
  {
    "start": "9 January 2026",
    "end": "30 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Saturn is Sextile Transiting Uranus",
    "description": "A good time to introduce reforms and to make changes. Knowing what is possible and achievable."
  },
  {
    "start": "9 January 2026",
    "end": "11 January 2026",
    "strongest": "10 January 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "10 January 2026",
    "end": "11 January 2026",
    "strongest": "11 January 2026",
    "aspect": "Transiting Mercury is Trine your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "11 January 2026",
    "end": "12 January 2026",
    "strongest": "11 January 2026",
    "aspect": "Transiting Mercury is Square your Natal Pluto",
    "description": "You are as sharp as a tack during this period and have the ability to influence others through persuasive speaking or writing. However, if you express extreme or fanatical opinions you will tend to turn people off."
  },
  {
    "start": "11 January 2026",
    "end": "13 January 2026",
    "strongest": "12 January 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "13 January 2026",
    "end": "14 January 2026",
    "strongest": "14 January 2026",
    "aspect": "Transiting Mercury is Opposition Transiting Jupiter",
    "description": "This can be a good time for making decisions or discussing important issues, as long as the prep work has been done beforehand. Difficulties through negligent or lazy thinking. Not keeping promises, or promising more than can be delivered. A need to avoid exaggerating or blowing things out of proportion."
  },
  {
    "start": "14 January 2026",
    "end": "16 January 2026",
    "strongest": "15 January 2026",
    "aspect": "Transiting Venus is Sextile Transiting Saturn",
    "description": "This can be a good time to re-define responsibilities and boundary lines in personal relationships. The head rules the heart and common sense prevails in romance. Serious or practical art forms."
  },
  {
    "start": "14 January 2026",
    "end": "16 January 2026",
    "strongest": "15 January 2026",
    "aspect": "Transiting Venus is Trine Transiting Uranus",
    "description": "Being attracted to the idea of doing something different and exciting. It is a time for snapping out of old patterns and routines. A mild flirtation could bring a smile to the face."
  },
  {
    "start": "16 January 2026",
    "end": "18 January 2026",
    "strongest": "17 January 2026",
    "aspect": "Transiting Venus is Sextile Transiting Neptune",
    "description": "This combination can increase the receptivity to beauty, art and music. The finer things in life appeal now, and creative or artistic imagination and inspiration are likely to be enhanced."
  },
  {
    "start": "17 January 2026",
    "end": "18 January 2026",
    "strongest": "17 January 2026",
    "aspect": "Transiting Venus is Sextile your Natal Ascendant",
    "description": "This transit creates a light-hearted and easy-going atmosphere. You should enjoy good relations with others at the moment."
  },
  {
    "start": "17 January 2026",
    "end": "19 January 2026",
    "strongest": "18 January 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Mars",
    "description": "Having the power to supply a ready answer when challenged and to effectively convince others of own ideas. However, there may be the tendency to jump to conclusions and to speak first before thinking of the consequences. Mental alertness. Lively discussions and debates. Putting ideas into action. Accident proneness."
  },
  {
    "start": "17 January 2026",
    "end": "19 January 2026",
    "strongest": "18 January 2026",
    "aspect": "Transiting Venus is Sextile your Natal Sun",
    "description": "This transit can make for a pleasant and easy-going interval. People around you are obliging and courteous. You tend to feel good about yourself and your appearance. Social occasions are enjoyable now."
  },
  {
    "start": "17 January 2026",
    "end": "2 April 2026",
    "strongest": "18 February 2026",
    "aspect": "Transiting Pluto is Square your Natal Moon",
    "description": "During this transit, you will be subjected to intense emotional pressure, either through the surfacing of deep-seated feelings associated with your past, or through the influence of another whose presence causes you emotional turmoil in some way. Possibly, emotional, family or domestic circumstances will undergo transformation and upheaval. In certain cases, this may be a time for re-locating or changing residence. An influential woman in your life can have a profound effect on you at this time. There is the potential for emotionally charged power struggles, coupled with issues of emotional control and dominance. Emotional relationships, in particular, can come under pressure now, and those that are already shaky can break up completely. Positively, this transit can enable you to clear out or purge any aspects of your emotional life that limit or restrict you."
  },
  {
    "start": "18 January 2026",
    "end": "19 January 2026",
    "strongest": "19 January 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Saturn",
    "description": "This is an excellent time for setting up a time-in-motion study. Tedious tasks won't seem so tedious now. Concentration is good and thinking is practical and realistic."
  },
  {
    "start": "18 January 2026",
    "end": "19 January 2026",
    "strongest": "19 January 2026",
    "aspect": "Transiting Mercury is Trine Transiting Uranus",
    "description": "Reliable intuition. Original ideas and flashes of inspiration can be expected. Demonstrating intellectual flexibility and lateral thinking. Keen powers of observation."
  },
  {
    "start": "18 January 2026",
    "end": "21 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Mars is Sextile Transiting Saturn",
    "description": "Being unfazed by hard work and long hours. Disciplined action and energy. The ability to carry a task or project through to a successful conclusion. Willpower and determination. The power of endurance."
  },
  {
    "start": "18 January 2026",
    "end": "18 January 2026",
    "strongest": "18 January 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "18 January 2026",
    "end": "21 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Mars is Trine Transiting Uranus",
    "description": "The urge to try something new or out the ordinary. Increased courage to experiment or to introduce reforms. The power to make changes. Acting independently. Quick reflexes."
  },
  {
    "start": "19 January 2026",
    "end": "20 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Pluto",
    "description": "Intensified feelings in love and affection. Passionate interactions with others. The tendency to be drawn to another as if by some kind of inner compulsion. Conversely, there can be the tendency to attract the amorous urges of others. Sexual tensions and excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "19 January 2026",
    "end": "21 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Neptune",
    "description": "A somewhat dreamy and romantic outlook. Power of presentiment. Inspired thinking. Artistic appreciation. Music, poetry, film and artistic creativity can flourish."
  },
  {
    "start": "20 January 2026",
    "end": "21 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Venus is Square your Natal Moon",
    "description": "The only thing that might spoil this period is irritability - your own or another's. There may be friction in the home or family, or with women."
  },
  {
    "start": "20 January 2026",
    "end": "21 January 2026",
    "strongest": "20 January 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Ascendant",
    "description": "Communications with others should go well now. You can take part in important discussions or small talk with equal skill."
  },
  {
    "start": "20 January 2026",
    "end": "21 January 2026",
    "strongest": "21 January 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Sun",
    "description": "Anticipate an intellectually stimulating interval, with all sorts of people trying to get in touch with you. A good time for doing mental work and for catching up on outstanding paperwork."
  },
  {
    "start": "21 January 2026",
    "end": "24 January 2026",
    "strongest": "23 January 2026",
    "aspect": "Transiting Mars is Sextile Transiting Neptune",
    "description": "Physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. It may be a good time to go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "22 January 2026",
    "end": "23 January 2026",
    "strongest": "22 January 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Pluto",
    "description": "Intellectual powers and comprehension are as sharp as a tack during this period and the capability to exercise an influence over others through persuasive speaking or writing is accentuated. However, expressing extremist or fanatical opinions will tend to polarise people. Intense conversations. Mental troubles. Paranoia. Cunning and craft."
  },
  {
    "start": "22 January 2026",
    "end": "23 January 2026",
    "strongest": "23 January 2026",
    "aspect": "Transiting Mercury is Square your Natal Moon",
    "description": "Reason and emotion may be at odds with each other at the moment and communications with others, especially females or family members, could be tense. Try and be up-front with people, as this can help to avoid misunderstandings."
  },
  {
    "start": "22 January 2026",
    "end": "23 March 2026",
    "strongest": "24 February 2026",
    "aspect": "Transiting Neptune is Trine your Natal Sun",
    "description": "During this period, you will strive to know more about yourself as a spiritual and creative being. This is an excellent time for meditation and reflection, because you can receive profound insights about yourself and life in general. Also, if you are in anyway artistically inclined, your powers of imagination and inspiration are accentuated now. Long distance travel may also occur under this influence and be highly stimulating and inspiring, because you will be open to new impressions and sensations."
  },
  {
    "start": "22 January 2026",
    "end": "25 January 2026",
    "strongest": "24 January 2026",
    "aspect": "Transiting Mars is Sextile your Natal Ascendant",
    "description": "During this period, you can assert yourself more easily, without offending or upsetting others in the process. At this time, you are more direct and sure of yourself and people know what to expect of you. If you have leadership ability it is likely to be expressed in some way now."
  },
  {
    "start": "23 January 2026",
    "end": "25 January 2026",
    "strongest": "24 January 2026",
    "aspect": "Transiting Mars is Sextile your Natal Sun",
    "description": "Your energies are strong and positive now. This is a good time to set goals, as you can achieve them. You have the drive, determination and motivation to get things done."
  },
  {
    "start": "24 January 2026",
    "end": "25 January 2026",
    "strongest": "24 January 2026",
    "aspect": "Transiting Venus is Opposition your Natal Mars",
    "description": "Your emotions are likely to run hot and cold during this period, which may cause people to wonder what to expect from one moment to the next. There is a potential for arguments and disagreements. Romantically, you may be inclined to come on too strongly and aggressively."
  },
  {
    "start": "25 January 2026",
    "end": "26 January 2026",
    "strongest": "26 January 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Mars",
    "description": "This planetary pairing speeds up your life. Your mind is razor sharp and your powers of comprehension are second to none now. However, if you're in too much of a rush to get things done, you risk making mistakes and wrong decisions. Sudden arguments are likely to flare up."
  },
  {
    "start": "26 January 2026",
    "end": "29 January 2026",
    "strongest": "27 January 2026",
    "aspect": "Transiting Mars is Conjunct Transiting Pluto",
    "description": "Powerful drives. Extreme efforts. The desire to dominate or to rule. The urge to change things, to eliminate and purify. High energy output. Negatively, there can be the tendency to act ruthlessly or brutally. Power struggles. Obsessions. Violence. Danger of accidents and injuries."
  },
  {
    "start": "27 January 2026",
    "end": "28 January 2026",
    "strongest": "28 January 2026",
    "aspect": "Transiting Venus is Square your Natal Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "27 January 2026",
    "end": "31 January 2026",
    "strongest": "29 January 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Venus",
    "description": "Light-heartedness and a desire for fun and entertainment. Communications with friends, loved ones and even strangers have a natural flow to them over this period. A courteous and pleasant manner can win friends and influence people. This can be a good time for socialising, or for discussing matters of the heart, or art."
  },
  {
    "start": "27 January 2026",
    "end": "30 January 2026",
    "strongest": "28 January 2026",
    "aspect": "Transiting Mars is Square your Natal Moon",
    "description": "You, or someone in your environment, may be more moody or irritable than usual now. The smallest thing can set off an emotional reaction. Tread carefully and be aware of the feelings of those around you, especially family members. There is a risk of accident proneness now."
  },
  {
    "start": "27 January 2026",
    "end": "29 January 2026",
    "strongest": "28 January 2026",
    "aspect": "Transiting Mercury is Square your Natal Uranus",
    "description": "Expressing either original or eccentric ideas or actions now will get you noticed. You could have some difficulties appreciating other people's points of view, due to self-willed or inflexible thinking. Breakdowns in communication or transport are possible."
  },
  {
    "start": "28 January 2026",
    "end": "30 January 2026",
    "strongest": "29 January 2026",
    "aspect": "Transiting Venus is Sextile your Natal Neptune",
    "description": "This transit can increase your receptivity to beauty, art and music. The finer things in life have an appeal now and, if you are creative or artistic, your powers of imagination and inspiration are likely to be enhanced now."
  },
  {
    "start": "29 January 2026",
    "end": "30 January 2026",
    "strongest": "29 January 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Neptune",
    "description": "A somewhat dreamy and romantic mood influences your thinking at the moment. You are at risk of being mentally lax and careless now, but equally, there is the possibility of inspired and imaginative thinking too. Music, poetry, film and artistic creativity can flourish during this transit."
  },
  {
    "start": "29 January 2026",
    "end": "30 January 2026",
    "strongest": "30 January 2026",
    "aspect": "Transiting Venus is Trine your Natal Pluto",
    "description": "This transit can make you aware of subtle undercurrents and possible attraction between you and another. Acknowledge any feelings you may have, but avoid trying to manipulate situations."
  },
  {
    "start": "29 January 2026",
    "end": "30 January 2026",
    "strongest": "29 January 2026",
    "aspect": "Transiting Mercury is Trine your Natal Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Release information on \"a need to know basis\" when dealing with others."
  },
  {
    "start": "29 January 2026",
    "end": "30 January 2026",
    "strongest": "30 January 2026",
    "aspect": "Transiting Mercury is Square your Natal Venus",
    "description": "A lack of drive or self-motivation is possible now. You may be more inclined to adopt a care-free attitude and treat yourself to little indulgences. Your thinking is more likely than not to be on love and romance, or play. Positively, you may demonstrate a talent for artistic creativity now."
  },
  {
    "start": "29 January 2026",
    "end": "31 January 2026",
    "strongest": "30 January 2026",
    "aspect": "Transiting Venus is Square your Natal Venus",
    "description": "Little annoyances could spoil what can be an otherwise pleasant period, if you're not careful. You should try to make every effort to get on with others and not to react to situations or provocations."
  },
  {
    "start": "30 January 2026",
    "end": "23 February 2026",
    "strongest": "9 February 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Venus",
    "description": "While not an especially strong transit in its outward effects, Jupiter in harmonious aspect to Venus can make for a pleasant and relaxing interval. If you are aware of its timing well enough in advance you may like to plan a short holiday or social occasion to coincide with its duration, because either should be successful. Travel is also well-aspected under this influence. Relationships tend to go well now."
  },
  {
    "start": "31 January 2026",
    "end": "1 February 2026",
    "strongest": "1 February 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Mercury",
    "description": "This is an excellent time for all types of communication. You can present your ideas or arguments well now. Business decisions and short distance travel are well-aspected."
  },
  {
    "start": "1 February 2026",
    "end": "3 February 2026",
    "strongest": "2 February 2026",
    "aspect": "Transiting Venus is Sextile your Natal Mercury",
    "description": "During this transit, you express a pleasant and cordial manner that others find attractive. Social affairs are easily arranged and staged now."
  },
  {
    "start": "1 February 2026",
    "end": "1 February 2026",
    "strongest": "1 February 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "2 February 2026",
    "end": "5 February 2026",
    "strongest": "4 February 2026",
    "aspect": "Transiting Mars is Opposition your Natal Mars",
    "description": "You have an excess of energy to burn at the moment. There is a tendency to act impulsively and rashly now, which can lead to accidents, injuries or conflicts with other people."
  },
  {
    "start": "4 February 2026",
    "end": "6 February 2026",
    "strongest": "5 February 2026",
    "aspect": "Transiting Mercury is Square Transiting Uranus",
    "description": "Expressing either original or eccentric ideas. May be difficulties appreciating another's point of view, due to rigid or inflexible thinking. Easy excitability and nervous tension. Breakdowns in communication or transport are possible."
  },
  {
    "start": "6 February 2026",
    "end": "13 April 2026",
    "strongest": "18 February 2026",
    "aspect": "Transiting Jupiter is Square your Natal Pluto",
    "description": "During this period, you will be aware of a pronounced desire to assert yourself and to get ahead in life - even if it pitches you against the expectations and beliefs of others. Compulsive behaviour and power plays are common with this transit and you have to be very careful who you take on as an opponent. Those in positions of power, such as bosses or authority figures could make your life difficult if you get out of your depth with them. In extreme circumstances, if you over-estimate yourself or display excessive arrogance, the consequences won't be to your liking. Also, there can be the tendency to become zealous or obsessive, which can lead to arguments with others or cause you to lose sight of whom or what is important in your life. Positively, you may demonstrate a capacity for leadership and organisation - an ability to step in and take charge of situations."
  },
  {
    "start": "6 February 2026",
    "end": "7 February 2026",
    "strongest": "7 February 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Saturn",
    "description": "Your thinking and decision making processes tend to be slower than usual during this period. Your mind is occupied with serious or important matters. There can be miscommunications with others or transport problems and delays now."
  },
  {
    "start": "6 February 2026",
    "end": "7 February 2026",
    "strongest": "7 February 2026",
    "aspect": "Transiting Mercury is Square your Natal Ascendant",
    "description": "Your personal environment is likely to be very busy now, with many communications and conversations with others. However, a word out of place or a rash decision could cause heated arguments."
  },
  {
    "start": "6 February 2026",
    "end": "8 February 2026",
    "strongest": "7 February 2026",
    "aspect": "Transiting Mercury is Square your Natal Sun",
    "description": "Communications with others take on a personal or subjective tone and they may not necessarily be harmonious. You may need to hold your tongue. There can be breakdowns in communication."
  },
  {
    "start": "7 February 2026",
    "end": "9 February 2026",
    "strongest": "8 February 2026",
    "aspect": "Transiting Venus is Square Transiting Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "7 February 2026",
    "end": "4 March 2026",
    "strongest": "20 February 2026",
    "aspect": "Transiting Saturn is Conjunct Transiting Neptune",
    "description": "Tensions between socialist and capitalist values. Suspicions and hysteria. The collapse of an ideology. Insecurity and confusion. Fear of the unknown. Being easily discouraged and misled. Undermining of reputation or reality base. Secret enemies. Illnesses. Poisonings. Damage to waterways and oceans. Hardening of beliefs."
  },
  {
    "start": "8 February 2026",
    "end": "10 February 2026",
    "strongest": "9 February 2026",
    "aspect": "Transiting Mars is Square your Natal Uranus",
    "description": "Expect pressures and potential arguments caused by inner tensions or stress in either yourself or others. There is a danger of accidents or injuries during this period."
  },
  {
    "start": "8 February 2026",
    "end": "9 February 2026",
    "strongest": "9 February 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Moon",
    "description": "You are more in touch with your own and others' feelings now. If you have anything on your mind you're unsure about, you should be able to find good listeners and advisers during this transit. This is a good decision making period."
  },
  {
    "start": "9 February 2026",
    "end": "10 February 2026",
    "strongest": "9 February 2026",
    "aspect": "Transiting Mercury is Trine your Natal Jupiter",
    "description": "Positive thinking makes anything possible now. This is a good transit for communicating your ideas to others, making decisions and undertaking short journeys."
  },
  {
    "start": "9 February 2026",
    "end": "26 February 2026",
    "strongest": "18 February 2026",
    "aspect": "Transiting Saturn is Trine your Natal Ascendant",
    "description": "This can be a very good time for improving your relationships with people across the full spectrum of your life - including family, friends, acquaintances and professional contacts. You have a lot of patience with other people now and nothing is too much for you where others are concerned. Older and mature people are beneficial to you now and you can learn a lot from them."
  },
  {
    "start": "9 February 2026",
    "end": "11 February 2026",
    "strongest": "10 February 2026",
    "aspect": "Transiting Venus is Opposition your Natal Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty now. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed."
  },
  {
    "start": "10 February 2026",
    "end": "11 February 2026",
    "strongest": "10 February 2026",
    "aspect": "Transiting Venus is Square your Natal Ascendant",
    "description": "You have the power to draw others to you and to make a good impression on people. Your relations with other people are better than usual and your social calendar is likely to be quite full. However, there can be tensions with others caused through vanity or inconsiderateness."
  },
  {
    "start": "10 February 2026",
    "end": "11 February 2026",
    "strongest": "11 February 2026",
    "aspect": "Transiting Venus is Square your Natal Sun",
    "description": "During this transit, you enjoy socialising and indulging yourself. You may amuse yourself with passing flirtations. You are not likely to be very productive now, but does it matter? There can be minor tensions with loved ones."
  },
  {
    "start": "10 February 2026",
    "end": "13 February 2026",
    "strongest": "11 February 2026",
    "aspect": "Transiting Mars is Sextile your Natal Neptune",
    "description": "Your physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. Spend some time in reflection, go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "11 February 2026",
    "end": "13 February 2026",
    "strongest": "12 February 2026",
    "aspect": "Transiting Mars is Trine your Natal Pluto",
    "description": "During this transit, you may dare to transform something about yourself; your appearance, personal surroundings or your relationship with another or group of people. You can achieve results now through perseverance and persistence."
  },
  {
    "start": "12 February 2026",
    "end": "14 February 2026",
    "strongest": "13 February 2026",
    "aspect": "Transiting Mars is Square your Natal Venus",
    "description": "This transit can bring about an intensification of passion and romantic fervour in you, which may or may not be reciprocated by another. Alternatively, the ardour of another could be directed at you. There may be arguments and disputes with loved ones caused by a lack of consideration or tactlessness. Selfishness in love is possible."
  },
  {
    "start": "13 February 2026",
    "end": "14 February 2026",
    "strongest": "13 February 2026",
    "aspect": "Transiting Venus is Sextile your Natal Moon",
    "description": "This transit can create an agreeable and gentle atmosphere. Others seem more receptive to your emotional needs. Social activity within the home or with the family is easy and relaxing."
  },
  {
    "start": "13 February 2026",
    "end": "2 March 2026",
    "strongest": "21 February 2026",
    "aspect": "Transiting Saturn is Trine your Natal Sun",
    "description": "There is much you can achieve at this time if you put your mind to it and apply yourself to the task at hand. You may receive some acknowledgement from a superior for past efforts and work well done. Your self-control and self-discipline are in good shape at the moment. Successes are possible now through patience and perseverance, coupled with a realistic sense of what's achievable."
  },
  {
    "start": "13 February 2026",
    "end": "14 February 2026",
    "strongest": "14 February 2026",
    "aspect": "Transiting Venus is Trine your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "14 February 2026",
    "end": "15 February 2026",
    "strongest": "15 February 2026",
    "aspect": "Transiting Mercury is Trine your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "15 February 2026",
    "end": "16 February 2026",
    "strongest": "15 February 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Midheaven",
    "description": "Domestic matters occupy your mind at the moment. This is a good time for making decisions relating to home and family life."
  },
  {
    "start": "15 February 2026",
    "end": "17 February 2026",
    "strongest": "16 February 2026",
    "aspect": "Transiting Mercury is Square your Natal Neptune",
    "description": "Your powers of judgement may prove to be faulty under this influence. You are prone to unrealistic thinking now and will have to guard against exposure to lies or deceptions. When communicating, you need to be very sure that others understand exactly what you mean, as there is a risk of misunderstandings."
  },
  {
    "start": "16 February 2026",
    "end": "17 February 2026",
    "strongest": "16 February 2026",
    "aspect": "Transiting Mercury is Trine Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "16 February 2026",
    "end": "18 February 2026",
    "strongest": "17 February 2026",
    "aspect": "Transiting Mars is Sextile your Natal Mercury",
    "description": "This is an excellent time for getting your views and opinions and thoughts across to others. Intellectually, you are sharp and have the ability to comprehend things quickly."
  },
  {
    "start": "16 February 2026",
    "end": "18 February 2026",
    "strongest": "17 February 2026",
    "aspect": "Transiting Mercury is Trine your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "17 February 2026",
    "end": "17 February 2026",
    "strongest": "17 February 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "17 February 2026",
    "end": "17 February 2026",
    "strongest": "17 February 2026",
    "aspect": "Solar Eclipse",
    "description": ""
  },
  {
    "start": "19 February 2026",
    "end": "21 February 2026",
    "strongest": "20 February 2026",
    "aspect": "Transiting Mercury is Square your Natal Mercury",
    "description": "Communicating with others may be difficult or irritating now; they are likely to challenge your views and opinions. Also, avoid making important decisions, if possible. There can be transport problems too."
  },
  {
    "start": "20 February 2026",
    "end": "21 February 2026",
    "strongest": "21 February 2026",
    "aspect": "Transiting Venus is Trine your Natal Uranus",
    "description": "You are attracted to the idea of doing something different and exciting at the moment. It is a good time for snapping out of old patterns and routines. Perhaps a mild flirtation could give you a moment to remember?"
  },
  {
    "start": "21 February 2026",
    "end": "22 February 2026",
    "strongest": "21 February 2026",
    "aspect": "Transiting Venus is Opposition your Natal Midheaven",
    "description": "Now is a perfect time for home decorating or entertaining. Family and domestic relationships should be good during this transit. Any areas of discord within the home or family can be dealt with now."
  },
  {
    "start": "21 February 2026",
    "end": "23 February 2026",
    "strongest": "22 February 2026",
    "aspect": "Transiting Venus is Square your Natal Neptune",
    "description": "Watch out! Unrealistic notions of love may cloud your thinking during this period. There is a risk of being misunderstood, or of having your romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "22 February 2026",
    "end": "23 February 2026",
    "strongest": "22 February 2026",
    "aspect": "Transiting Venus is Trine Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "22 February 2026",
    "end": "24 February 2026",
    "strongest": "23 February 2026",
    "aspect": "Transiting Venus is Trine your Natal Venus",
    "description": "There is a pleasant and relaxing quality to this period. You are more receptive to others now and people find you easy-going and approachable. Social get-togethers work well now. You may like to surround yourself with beauty or mix with artistic people."
  },
  {
    "start": "25 February 2026",
    "end": "27 February 2026",
    "strongest": "26 February 2026",
    "aspect": "Transiting Venus is Square your Natal Mercury",
    "description": "A little tact can go a long way during this period. There can be a risk of misunderstandings caused by moodiness or irritability."
  },
  {
    "start": "26 February 2026",
    "end": "28 February 2026",
    "strongest": "27 February 2026",
    "aspect": "Transiting Mars is Square Transiting Uranus",
    "description": "Expect pressures and potential arguments caused by inner tensions or stress. A danger exists from impulsive actions and accident proneness. Take care travelling or when around machinery and volatile materials. Quick anger and sudden aggression."
  },
  {
    "start": "27 February 2026",
    "end": "28 February 2026",
    "strongest": "28 February 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Venus",
    "description": "Light-heartedness and a desire for fun and entertainment. Communications with friends, loved ones and even strangers have a natural flow to them over this period. A courteous and pleasant manner can win friends and influence people. This can be a good time for socialising, or for discussing matters of the heart, or art."
  },
  {
    "start": "28 February 2026",
    "end": "22 March 2026",
    "strongest": "28 February 2026",
    "aspect": "Transiting Jupiter is Sextile your Natal Midheaven",
    "description": "This is likely to be a pleasant period in your life with respect to social activity and meeting people of good reputation. You could come into contact with influential people, who may be able to assist you in your career or some area of personal significance."
  },
  {
    "start": "1 March 2026",
    "end": "4 March 2026",
    "strongest": "2 March 2026",
    "aspect": "Transiting Mars is Opposition your Natal Saturn",
    "description": "During this period, your life seems to be moving at the rate of one step forward and one step backwards. You feel like you're driving with the handbrake on. Everything takes a lot of effort at the moment. Also, there is a strong risk of accidents or conflicts with others now, so take care."
  },
  {
    "start": "1 March 2026",
    "end": "4 March 2026",
    "strongest": "3 March 2026",
    "aspect": "Transiting Mars is Square your Natal Ascendant",
    "description": "During this period, you will tend to be very action orientated and self-motivated. You can get a lot accomplished now. However, you have to be careful that you don't push others around in the process, as it is likely to cause friction."
  },
  {
    "start": "2 March 2026",
    "end": "5 March 2026",
    "strongest": "3 March 2026",
    "aspect": "Transiting Mars is Square your Natal Sun",
    "description": "You have a desire to achieve things now, coupled with the drive to succeed. Expect an energy boost, but guard against over-exerting yourself physically, as it could lead to stress and strain. There is a risk of injury-proneness or conflicts with others."
  },
  {
    "start": "3 March 2026",
    "end": "5 March 2026",
    "strongest": "4 March 2026",
    "aspect": "Transiting Mercury is Square your Natal Mercury",
    "description": "Communicating with others may be difficult or irritating now; they are likely to challenge your views and opinions. Also, avoid making important decisions, if possible. There can be transport problems too."
  },
  {
    "start": "3 March 2026",
    "end": "3 March 2026",
    "strongest": "3 March 2026",
    "aspect": "Lunar Eclipse",
    "description": ""
  },
  {
    "start": "3 March 2026",
    "end": "3 March 2026",
    "strongest": "3 March 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "3 March 2026",
    "end": "5 March 2026",
    "strongest": "4 March 2026",
    "aspect": "Transiting Venus is Sextile Transiting Uranus",
    "description": "Being attracted to the idea of doing something different and exciting. It is a time for snapping out of old patterns and routines. A mild flirtation could bring a smile to the face."
  },
  {
    "start": "6 March 2026",
    "end": "7 March 2026",
    "strongest": "6 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Ascendant",
    "description": "This transit creates a light-hearted and easy-going atmosphere. You should enjoy good relations with others at the moment."
  },
  {
    "start": "6 March 2026",
    "end": "7 March 2026",
    "strongest": "7 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Sun",
    "description": "This transit can make for a pleasant and easy-going interval. People around you are obliging and courteous. You tend to feel good about yourself and your appearance. Social occasions are enjoyable now."
  },
  {
    "start": "6 March 2026",
    "end": "8 March 2026",
    "strongest": "7 March 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Neptune",
    "description": "Seeking spiritual union with another or others. Desiring union at a higher level. Platonic love. Dreaming of romantic adventure. Short enjoyable journeys. This is a wonderful combination for romance or artistic creativity. Alternatively, there can be the tendency to deception in love."
  },
  {
    "start": "6 March 2026",
    "end": "9 March 2026",
    "strongest": "7 March 2026",
    "aspect": "Transiting Mars is Sextile your Natal Moon",
    "description": "Allow your instincts to guide you in your actions during this period, and trust them when assessing the actions of others. This is a good time for doing things around the home or with your family."
  },
  {
    "start": "6 March 2026",
    "end": "8 March 2026",
    "strongest": "7 March 2026",
    "aspect": "Transiting Mercury is Trine your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "7 March 2026",
    "end": "9 March 2026",
    "strongest": "8 March 2026",
    "aspect": "Transiting Mars is Trine your Natal Jupiter",
    "description": "Other people are happy to co-operate with you over this period, because they can see your intentions are honourable. Business related matters, including personal transactions, are well-aspected now. Decide in your own mind what you want and go and get it."
  },
  {
    "start": "7 March 2026",
    "end": "9 March 2026",
    "strongest": "8 March 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Saturn",
    "description": "The head should rule the heart as opposed to the heart ruling the head. Calm and conservative thinking is necessary. Estrangements and separations are possible in love and friendship. Distance from others. Inhibitions. Jealousy. A general feeling of frustration or discontent. Emotional losses are possible."
  },
  {
    "start": "8 March 2026",
    "end": "10 March 2026",
    "strongest": "9 March 2026",
    "aspect": "Transiting Mercury is Square your Natal Neptune",
    "description": "Your powers of judgement may prove to be faulty under this influence. You are prone to unrealistic thinking now and will have to guard against exposure to lies or deceptions. When communicating, you need to be very sure that others understand exactly what you mean, as there is a risk of misunderstandings."
  },
  {
    "start": "8 March 2026",
    "end": "10 March 2026",
    "strongest": "9 March 2026",
    "aspect": "Transiting Mercury is Trine Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "9 March 2026",
    "end": "11 March 2026",
    "strongest": "10 March 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Midheaven",
    "description": "Domestic matters occupy your mind at the moment. This is a good time for making decisions relating to home and family life."
  },
  {
    "start": "9 March 2026",
    "end": "11 March 2026",
    "strongest": "10 March 2026",
    "aspect": "Transiting Venus is Square your Natal Jupiter",
    "description": "Party time! The desire to socialise and to indulge the senses is accentuated now. Just don't overdo it, because your body won't thank you afterwards. Self-indulgent tendencies are strong now. Travelling during this transit may not be enjoyable."
  },
  {
    "start": "9 March 2026",
    "end": "11 March 2026",
    "strongest": "10 March 2026",
    "aspect": "Transiting Venus is Sextile Transiting Pluto",
    "description": "Becoming aware of hidden attractions. Being drawn to another as if by some kind of inner compulsion. Intensification of passion."
  },
  {
    "start": "10 March 2026",
    "end": "12 March 2026",
    "strongest": "11 March 2026",
    "aspect": "Transiting Mercury is Trine your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "13 March 2026",
    "end": "14 March 2026",
    "strongest": "13 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Mars",
    "description": "You are in the mood for fun at the moment. Be socially spontaneous. A night out could be just what you need to relax."
  },
  {
    "start": "14 March 2026",
    "end": "16 March 2026",
    "strongest": "15 March 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Mars",
    "description": "Having the power to supply a ready answer when challenged and to effectively convince others of own ideas. However, there may be the tendency to jump to conclusions and to speak first before thinking of the consequences. Mental alertness. Lively discussions and debates. Putting ideas into action. Accident proneness."
  },
  {
    "start": "17 March 2026",
    "end": "2 April 2026",
    "strongest": "25 March 2026",
    "aspect": "Transiting Saturn is Square your Natal Jupiter",
    "description": "Even the most optimistic people in the world can expect to have their enthusiasm tested during this transit. Whatever your lifestyle, you will have to work harder for success now. This is a time for taking stock of things and cutting back. Maintain faith in your abilities, exercise patience and perseverance, proceed with caution and soon any obstacles will be overcome. This can be a good time for business and real estate, because you will be more careful now than usual and less likely to over-stretch yourself or your budget. Money will be tighter, so take great care with investments and expenditures. This is not a particularly good time to change jobs. If you are feeling dissatisfied with your current work, taking up a new position will not alleviate the dissatisfaction. Instead, wait until the transit passes and review your circumstances then. If you are naturally impatient and restless, you will tend to view this period as restricting and frustrating. Nothing seems to happen quickly enough. Your self-confidence and optimism may seem to temporarily desert you. However, successes are possible now through hard work and self-discipline."
  },
  {
    "start": "17 March 2026",
    "end": "19 March 2026",
    "strongest": "18 March 2026",
    "aspect": "Transiting Venus is Square Transiting Jupiter",
    "description": "Party time! The desire to socialise and to indulge the senses is accentuated now. However, there can be a tendency to over-indulgence and excess. Physical discomfort from too much of the 'good life'. Insincerity in love and affection can lead to hurts and slights."
  },
  {
    "start": "17 March 2026",
    "end": "19 March 2026",
    "strongest": "18 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Neptune",
    "description": "This transit can increase your receptivity to beauty, art and music. The finer things in life have an appeal now and, if you are creative or artistic, your powers of imagination and inspiration are likely to be enhanced now."
  },
  {
    "start": "18 March 2026",
    "end": "20 March 2026",
    "strongest": "19 March 2026",
    "aspect": "Transiting Mars is Trine your Natal Uranus",
    "description": "This transit can inspire you to try something new or out the ordinary. It increases your courage to experiment or to introduce reforms. You can make changes now."
  },
  {
    "start": "18 March 2026",
    "end": "19 March 2026",
    "strongest": "19 March 2026",
    "aspect": "Transiting Venus is Opposition your Natal Pluto",
    "description": "At this time, there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Conflicts or power struggles in love are possible."
  },
  {
    "start": "19 March 2026",
    "end": "19 March 2026",
    "strongest": "19 March 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "19 March 2026",
    "end": "7 April 2026",
    "strongest": "28 March 2026",
    "aspect": "Transiting Saturn is Sextile Transiting Pluto",
    "description": "Bringing new things into being successfully through untiring effort and disciplined action. Dedication and commitment to specific causes. Great achievements through perseverance and hard work."
  },
  {
    "start": "19 March 2026",
    "end": "22 March 2026",
    "strongest": "20 March 2026",
    "aspect": "Transiting Mars is Opposition your Natal Midheaven",
    "description": "Your focus needs to be on the domestic front at the moment, as there may be a proneness to arguments and disputes in the home or with family members. One way of counteracting potential discord in these areas is to direct your energies at jobs that need doing around the house."
  },
  {
    "start": "20 March 2026",
    "end": "23 March 2026",
    "strongest": "22 March 2026",
    "aspect": "Transiting Mars is Trine Transiting Jupiter",
    "description": "Business related matters, including personal transactions, are well-aspected now. Acting with integrity and a sense of purpose. Successful physical or martial activity. The ability to settle disputes amicably. A sense of honour."
  },
  {
    "start": "20 March 2026",
    "end": "23 March 2026",
    "strongest": "22 March 2026",
    "aspect": "Transiting Mars is Square your Natal Neptune",
    "description": "Anticipate a period of fluctuating energy levels, with a tendency towards feeling washed out or physically depleted. You are in danger of misdirecting your energies or misusing your power now. Escapist tendencies are quite strong now."
  },
  {
    "start": "21 March 2026",
    "end": "23 March 2026",
    "strongest": "22 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Mercury",
    "description": "During this transit, you express a pleasant and cordial manner that others find attractive. Social affairs are easily arranged and staged now."
  },
  {
    "start": "22 March 2026",
    "end": "24 March 2026",
    "strongest": "23 March 2026",
    "aspect": "Transiting Mars is Trine your Natal Venus",
    "description": "This is a good time for making social contacts or entertaining. You have the energy and enthusiasm for socialising. Creative activity or romance is well-aspected now."
  },
  {
    "start": "26 March 2026",
    "end": "29 March 2026",
    "strongest": "27 March 2026",
    "aspect": "Transiting Mars is Square your Natal Mercury",
    "description": "There is a force and a power in your communications at the moment. You feel like telling people exactly what's on your mind. There is a danger of arguments and disputes, or hasty words and actions. Impatience can result in bad decisions or accidents."
  },
  {
    "start": "26 March 2026",
    "end": "19 April 2026",
    "strongest": "10 April 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Venus",
    "description": "While not an especially strong transit in its outward effects, Jupiter in harmonious aspect to Venus can make for a pleasant and relaxing interval. If you are aware of its timing well enough in advance you may like to plan a short holiday or social occasion to coincide with its duration, because either should be successful. Travel is also well-aspected under this influence. Relationships tend to go well now."
  },
  {
    "start": "30 March 2026",
    "end": "31 March 2026",
    "strongest": "30 March 2026",
    "aspect": "Transiting Venus is Trine your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "30 March 2026",
    "end": "1 April 2026",
    "strongest": "31 March 2026",
    "aspect": "Transiting Mercury is Trine your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "31 March 2026",
    "end": "2 April 2026",
    "strongest": "1 April 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Midheaven",
    "description": "Domestic matters occupy your mind at the moment. This is a good time for making decisions relating to home and family life."
  },
  {
    "start": "1 April 2026",
    "end": "3 April 2026",
    "strongest": "2 April 2026",
    "aspect": "Transiting Mercury is Square your Natal Neptune",
    "description": "Your powers of judgement may prove to be faulty under this influence. You are prone to unrealistic thinking now and will have to guard against exposure to lies or deceptions. When communicating, you need to be very sure that others understand exactly what you mean, as there is a risk of misunderstandings."
  },
  {
    "start": "2 April 2026",
    "end": "2 April 2026",
    "strongest": "2 April 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "2 April 2026",
    "end": "3 April 2026",
    "strongest": "3 April 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Moon",
    "description": "The company of women is extremely well-favoured at the moment. Happy feelings abound. Artistic talents should be expressed if you are creative."
  },
  {
    "start": "2 April 2026",
    "end": "4 April 2026",
    "strongest": "3 April 2026",
    "aspect": "Transiting Mercury is Trine Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "2 April 2026",
    "end": "4 April 2026",
    "strongest": "3 April 2026",
    "aspect": "Transiting Venus is Sextile your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "2 April 2026",
    "end": "4 April 2026",
    "strongest": "4 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "3 April 2026",
    "end": "4 April 2026",
    "strongest": "3 April 2026",
    "aspect": "Transiting Venus is Square Transiting Pluto",
    "description": "At this time there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Amorous excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "6 April 2026",
    "end": "7 April 2026",
    "strongest": "7 April 2026",
    "aspect": "Transiting Mercury is Square your Natal Mercury",
    "description": "Communicating with others may be difficult or irritating now; they are likely to challenge your views and opinions. Also, avoid making important decisions, if possible. There can be transport problems too."
  },
  {
    "start": "6 April 2026",
    "end": "7 April 2026",
    "strongest": "7 April 2026",
    "aspect": "Transiting Venus is Square your Natal Mars",
    "description": "Your emotions are likely to run hot and cold during this period, which may cause people to wonder what to expect from one moment to the next. There is a potential for arguments and disagreements. Romantically, you may be inclined to come on too strongly and aggressively."
  },
  {
    "start": "7 April 2026",
    "end": "10 April 2026",
    "strongest": "8 April 2026",
    "aspect": "Transiting Mars is Sextile Transiting Uranus",
    "description": "The urge to try something new or out the ordinary. Increased courage to experiment or to introduce reforms. The power to make changes. Acting independently. Quick reflexes."
  },
  {
    "start": "9 April 2026",
    "end": "11 April 2026",
    "strongest": "10 April 2026",
    "aspect": "Transiting Mars is Trine your Natal Ascendant",
    "description": "During this period, you can assert yourself more easily, without offending or upsetting others in the process. At this time, you are more direct and sure of yourself and people know what to expect of you. If you have leadership ability it is likely to be expressed in some way now."
  },
  {
    "start": "9 April 2026",
    "end": "11 April 2026",
    "strongest": "10 April 2026",
    "aspect": "Transiting Venus is Opposition your Natal Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "9 April 2026",
    "end": "12 April 2026",
    "strongest": "10 April 2026",
    "aspect": "Transiting Mars is Trine your Natal Sun",
    "description": "Your energies are strong and positive now. This is a good time to set goals, as you can achieve them. You have the drive, determination and motivation to get things done."
  },
  {
    "start": "10 April 2026",
    "end": "12 April 2026",
    "strongest": "11 April 2026",
    "aspect": "Transiting Venus is Trine your Natal Midheaven",
    "description": "You are receptive to the finer things in life at the moment. If you are artistic, your creative powers may be enhanced now. Professional and domestic circumstances are harmonious now."
  },
  {
    "start": "11 April 2026",
    "end": "17 May 2026",
    "strongest": "30 April 2026",
    "aspect": "Transiting Uranus is Square your Natal Saturn",
    "description": "This can be a trying and tense period for you. Your powers of adaptability and endurance will be tested now, as you experience the sudden breaking down of old and familiar patterns and structures in your life. We all need structure in our lives in order to function properly; however there are some structures we create that actually prevent us from growing and moving forward. Those areas of your life that you find restrictive and inhibiting will be targeted first. Nothing is permanent; even those aspects of your life you think are rock solid. It is now the time to unlock the padlock in your mind and break out of any self-limiting patterns. During this period, you could do something like walk out of an oppressive relationship, throw in an unfulfilling job, or take risks you wouldn't ordinarily consider taking. This is an unpredictable time, but if you stay true to yourself and let go of those areas in your life that are holding you back, the long-term gains far outweigh the short-term disruptions. Under certain conditions, sudden separations or confinements can occur during this transit."
  },
  {
    "start": "11 April 2026",
    "end": "14 April 2026",
    "strongest": "13 April 2026",
    "aspect": "Transiting Mars is Conjunct Transiting Neptune",
    "description": "Wanting something but not feeling inclined to make the necessary effort. The urge to escape. Fluctuating energies or a lack of drive. A weak will or character. A danger of being a pushover. A risk of illness and infection. Danger from inflammable substances."
  },
  {
    "start": "12 April 2026",
    "end": "13 April 2026",
    "strongest": "13 April 2026",
    "aspect": "Transiting Venus is Opposition your Natal Venus",
    "description": "Little annoyances could spoil what can be an otherwise pleasant period, if you're not careful. You should try to make every effort to get on with others and not to react to situations or provocations."
  },
  {
    "start": "12 April 2026",
    "end": "14 April 2026",
    "strongest": "13 April 2026",
    "aspect": "Transiting Venus is Sextile Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "13 April 2026",
    "end": "15 April 2026",
    "strongest": "14 April 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Uranus",
    "description": "Reliable intuition. Original ideas and flashes of inspiration can be expected. Demonstrating intellectual flexibility and lateral thinking. Keen powers of observation."
  },
  {
    "start": "14 April 2026",
    "end": "17 April 2026",
    "strongest": "15 April 2026",
    "aspect": "Transiting Mars is Square your Natal Jupiter",
    "description": "You have the urge to live a full and active life now, coupled with the motivation to get successful results in your enterprises. You are competitive and confident in your ability to succeed. Negatively, there can be impatience or rashness, conflicts with others and accidents. There can also be financial or travel problems."
  },
  {
    "start": "14 April 2026",
    "end": "16 April 2026",
    "strongest": "15 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Ascendant",
    "description": "Communications with others should go well now. You can take part in important discussions or small talk with equal skill."
  },
  {
    "start": "15 April 2026",
    "end": "16 April 2026",
    "strongest": "15 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Sun",
    "description": "Anticipate an intellectually stimulating interval, with all sorts of people trying to get in touch with you. A good time for doing mental work and for catching up on outstanding paperwork."
  },
  {
    "start": "15 April 2026",
    "end": "18 April 2026",
    "strongest": "16 April 2026",
    "aspect": "Transiting Mars is Sextile Transiting Pluto",
    "description": "Daring to make radical changes. Having the power to push through reforms and to transform situations. Record efforts are possible; however overdoing things can lead to exhaustion."
  },
  {
    "start": "16 April 2026",
    "end": "22 May 2026",
    "strongest": "4 May 2026",
    "aspect": "Transiting Uranus is Opposition your Natal Ascendant",
    "description": "During this period, your intimate, one-to-one relationships need to be your primary area of concern. If you are in a partnership, this transit will test it. If it is strong and secure, it will undergo some stresses and tensions, but survive. If, however, your relationship is shaky and in trouble, this transit could cause a break-up. All partnerships tend to fall into a rut over time. Whatever condition your relationship is in, this transit will give it a shake-up. If you are not in a current partnership, you may begin one now and probably quite suddenly. Apart from relationship matters, this transit can affect your environment; there may be disruptions to your surroundings, such as new apartments being built next door and the associated construction noise, or you may have a desire to change your residence."
  },
  {
    "start": "16 April 2026",
    "end": "17 April 2026",
    "strongest": "17 April 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Neptune",
    "description": "The use of imagination. Artistic appreciation. Vision. Thinking one thing and saying another. Misinterpreting things. Being at risk from deception or misrepresentation of facts. A keen intuition and an appreciation of subtle nuances. Inspired thinking and colourful descriptive powers."
  },
  {
    "start": "17 April 2026",
    "end": "17 April 2026",
    "strongest": "17 April 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "17 April 2026",
    "end": "19 April 2026",
    "strongest": "18 April 2026",
    "aspect": "Transiting Mercury is Square your Natal Jupiter",
    "description": "This can be a good time for discussing important issues, as long as you keep everything in perspective and don't exaggerate or blow things out of proportion. Avoid hasty decisions."
  },
  {
    "start": "18 April 2026",
    "end": "19 April 2026",
    "strongest": "18 April 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Sharp thinking and keen judgement. A critical mind. The power of persuasion."
  },
  {
    "start": "18 April 2026",
    "end": "21 April 2026",
    "strongest": "19 April 2026",
    "aspect": "Transiting Mars is Conjunct Transiting Saturn",
    "description": "Blocked energy. The inability to take action, or the tendency to act negatively. A risk of accidents or injuries. Illness. Acts of violence. War-like behaviour. Destructiveness. Separations and losses."
  },
  {
    "start": "19 April 2026",
    "end": "22 April 2026",
    "strongest": "20 April 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Mars",
    "description": "Having the power to supply a ready answer when challenged and to effectively convince others of own ideas. However, there may be the tendency to jump to conclusions and to speak first before thinking of the consequences. Mental alertness. Lively discussions and debates. Putting ideas into action. Accident proneness."
  },
  {
    "start": "19 April 2026",
    "end": "21 April 2026",
    "strongest": "20 April 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Saturn",
    "description": "Serious and realistic thinking applies now, which at its best is practical, but at its worst, narrow and pessimistic. There can be miscommunications during this planetary influence, or transport problems and delays. Negative thinking and speaking."
  },
  {
    "start": "20 April 2026",
    "end": "23 April 2026",
    "strongest": "21 April 2026",
    "aspect": "Transiting Mars is Trine your Natal Mars",
    "description": "You can expect an energy boost now, coupled with an increase in self-motivation. This is an excellent transit for getting things done, or for participating in sport or some form of physical exercise."
  },
  {
    "start": "20 April 2026",
    "end": "21 April 2026",
    "strongest": "21 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Mars",
    "description": "During this period, you are intellectually sharp and able to talk yourself into and out of just about anything now. You can get things done now if you put mind to it."
  },
  {
    "start": "23 April 2026",
    "end": "11 May 2026",
    "strongest": "1 May 2026",
    "aspect": "Transiting Saturn is Trine your Natal Mars",
    "description": "You now have the self-discipline and determination to tackle those tasks you've had simmering on the backburner for some time. Your powers of perseverance and endurance are stronger and you will be able to accomplish a lot."
  },
  {
    "start": "23 April 2026",
    "end": "24 April 2026",
    "strongest": "24 April 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Uranus",
    "description": "Sudden attractions or unexpected events in love. The tendency to become quickly excited or aroused. Emotional excitability. A flair for seduction. Unstable relationships will be tested now and break ups are possible. Artistic expression that is unique and original."
  },
  {
    "start": "23 April 2026",
    "end": "25 April 2026",
    "strongest": "24 April 2026",
    "aspect": "Transiting Venus is Square your Natal Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty now. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed."
  },
  {
    "start": "23 April 2026",
    "end": "25 April 2026",
    "strongest": "24 April 2026",
    "aspect": "Transiting Venus is Opposition your Natal Ascendant",
    "description": "You may be surprised at just how co-operative and helpful others are towards you now. Your relations with other people are better than usual and your social calendar is likely to be quite full."
  },
  {
    "start": "24 April 2026",
    "end": "25 April 2026",
    "strongest": "24 April 2026",
    "aspect": "Transiting Venus is Opposition your Natal Sun",
    "description": "During this transit, you enjoy socialising and indulging yourself. You may amuse yourself with passing flirtations. You are not likely to be very productive now, but does it matter? There can be minor tensions with loved ones."
  },
  {
    "start": "24 April 2026",
    "end": "29 May 2026",
    "strongest": "12 May 2026",
    "aspect": "Transiting Uranus is Opposition your Natal Sun",
    "description": "These are fast-moving times. Nothing stands still for very long while you are under the influence of this transit. Even if it makes you nervous, you want to make a number of changes in your life. New and interesting people will enter your life now and introduce you to many new experiences, some of which you may never have thought possible. Whether you enjoy these experiences or not will depend on how you feel about change in general. Whatever your personal circumstances, you will be restless and unsettled; you may also experience disturbed sleep. All of these are signs of a strong inner desire to break out of your old routines and to revitalise and re-invent yourself. Some people change their jobs or place of residence under this influence, even break away from relationships that have become dull and predictable. Of course, not everyone has to make such radical changes. If you are in control of your own life, you will see this period as an opportunity for making some changes. You could, for example, decide to \"get up to speed\" with technology or change a few things around the home or office. If, however, you are not in control of your life, you will either start kicking against any restrictions or begin to experience sudden upsets from external sources. A partner may suddenly leave or cause you unrest, or you could be suddenly faced with disruptions at work or in your neighbourhood. All of these are signs that you are not in full command of your circumstances and that you need to make adjustments to your lifestyle. One word of caution, you may have to take extra care of your health, as there can be a tendency to stress-related illnesses or even accidents. Your relationship to a male may change under this influence."
  },
  {
    "start": "24 April 2026",
    "end": "25 April 2026",
    "strongest": "25 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Neptune",
    "description": "A somewhat dreamy and romantic mood influences your thinking at the moment. You are at risk of being mentally lax and careless now, but equally, there is the possibility of inspired and imaginative thinking too. Music, poetry, film and artistic creativity can flourish during this transit."
  },
  {
    "start": "24 April 2026",
    "end": "25 April 2026",
    "strongest": "25 April 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Pluto",
    "description": "You are as sharp as a tack during this period and have the ability to influence others through persuasive speaking or writing. However, if you express extreme or fanatical opinions you will tend to turn people off."
  },
  {
    "start": "25 April 2026",
    "end": "27 April 2026",
    "strongest": "26 April 2026",
    "aspect": "Transiting Venus is Sextile Transiting Neptune",
    "description": "This combination can increase the receptivity to beauty, art and music. The finer things in life appeal now, and creative or artistic imagination and inspiration are likely to be enhanced."
  },
  {
    "start": "26 April 2026",
    "end": "27 April 2026",
    "strongest": "26 April 2026",
    "aspect": "Transiting Mercury is Square Transiting Jupiter",
    "description": "This can be a good time for making decisions or discussing important issues, as long as the prep work has been done beforehand. Difficulties through negligent or lazy thinking. Not keeping promises, or promising more than can be delivered. A need to avoid exaggerating or blowing things out of proportion."
  },
  {
    "start": "27 April 2026",
    "end": "28 April 2026",
    "strongest": "27 April 2026",
    "aspect": "Transiting Mercury is Trine your Natal Mercury",
    "description": "This is an excellent time for all types of communication. You can present your ideas or arguments well now. Business decisions and short distance travel are well-aspected."
  },
  {
    "start": "27 April 2026",
    "end": "29 April 2026",
    "strongest": "28 April 2026",
    "aspect": "Transiting Venus is Trine Transiting Pluto",
    "description": "Becoming aware of hidden attractions. Being drawn to another as if by some kind of inner compulsion. Intensification of passion."
  },
  {
    "start": "28 April 2026",
    "end": "30 April 2026",
    "strongest": "29 April 2026",
    "aspect": "Transiting Mars is Trine your Natal Neptune",
    "description": "Your physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. Spend some time in reflection, go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "28 April 2026",
    "end": "1 May 2026",
    "strongest": "30 April 2026",
    "aspect": "Transiting Mars is Opposition your Natal Pluto",
    "description": "You feel driven and compelled to achieve a lot now; however there is a real danger of over-estimating your physical drives and running yourself ragged. You may act territorially and aggressively towards others and experience intense power struggles. There is also a danger of accidents or injuries."
  },
  {
    "start": "30 April 2026",
    "end": "2 May 2026",
    "strongest": "1 May 2026",
    "aspect": "Transiting Venus is Sextile Transiting Saturn",
    "description": "This can be a good time to re-define responsibilities and boundary lines in personal relationships. The head rules the heart and common sense prevails in romance. Serious or practical art forms."
  },
  {
    "start": "30 April 2026",
    "end": "2 May 2026",
    "strongest": "1 May 2026",
    "aspect": "Transiting Venus is Sextile your Natal Mars",
    "description": "You are in the mood for fun at the moment. Be socially spontaneous. A night out could be just what you need to relax."
  },
  {
    "start": "1 May 2026",
    "end": "1 May 2026",
    "strongest": "1 May 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "2 May 2026",
    "end": "3 May 2026",
    "strongest": "3 May 2026",
    "aspect": "Transiting Mercury is Trine your Natal Saturn",
    "description": "This is a good time for attending to practical matters. You are able to plan well and to make arrangements. Your thinking is considered and realistic."
  },
  {
    "start": "3 May 2026",
    "end": "6 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Mars is Square Transiting Jupiter",
    "description": "Having the urge to live a full and busy life and to get successful results from actions taken. Competitive and motivated to succeed. Conflicts are possible over matters of outlook or religion. Legal, business or relationship disputes. Exaggerated actions or reactions."
  },
  {
    "start": "4 May 2026",
    "end": "6 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Mars is Trine your Natal Mercury",
    "description": "This is an excellent time for getting your views and opinions and thoughts across to others. Intellectually, you are sharp and have the ability to comprehend things quickly."
  },
  {
    "start": "4 May 2026",
    "end": "5 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Moon",
    "description": "This is a good time for you to communicate your feelings to others. Equally, the words or ideas of others can influence you more than usual. Communications with females or family members are likely now. There may the need for you to make decisions that affect your emotional, family or domestic life. Instinct plays a large part in your decision making processes at the moment."
  },
  {
    "start": "5 May 2026",
    "end": "6 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Jupiter",
    "description": "Positive thinking makes anything possible now. This is a good transit for communicating your ideas to others, making decisions and undertaking short journeys."
  },
  {
    "start": "5 May 2026",
    "end": "6 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Venus is Square your Natal Midheaven",
    "description": "Now is a perfect time for home decorating or entertaining. Family and domestic relationships should be good during this transit. Any areas of discord within the home or family can be dealt with now."
  },
  {
    "start": "5 May 2026",
    "end": "6 May 2026",
    "strongest": "5 May 2026",
    "aspect": "Transiting Mercury is Square Transiting Pluto",
    "description": "Intellectual powers and comprehension are as sharp as a tack during this period and the capability to exercise an influence over others through persuasive speaking or writing is accentuated. However, expressing extremist or fanatical opinions will tend to turn people off. Mental troubles. Paranoia. Cunning and craft."
  },
  {
    "start": "5 May 2026",
    "end": "7 May 2026",
    "strongest": "6 May 2026",
    "aspect": "Transiting Venus is Opposition your Natal Neptune",
    "description": "Watch out! Unrealistic notions of love may cloud your thinking during this period. There is a risk of being misunderstood, or of having your romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "6 May 2026",
    "end": "8 May 2026",
    "strongest": "7 May 2026",
    "aspect": "Transiting Venus is Trine your Natal Pluto",
    "description": "This transit can make you aware of subtle undercurrents and possible attraction between you and another. Acknowledge any feelings you may have, but avoid trying to manipulate situations."
  },
  {
    "start": "7 May 2026",
    "end": "8 May 2026",
    "strongest": "7 May 2026",
    "aspect": "Transiting Mercury is Square your Natal Mars",
    "description": "This planetary pairing speeds up your life. Your mind is razor sharp and your powers of comprehension are second to none now. However, if you're in too much of a rush to get things done, you risk making mistakes and wrong decisions. Sudden arguments are likely to flare up."
  },
  {
    "start": "9 May 2026",
    "end": "10 May 2026",
    "strongest": "9 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Uranus",
    "description": "Expressing either original or eccentric ideas or actions now will get you noticed. You could have some difficulties appreciating other people's points of view, due to self-willed or inflexible thinking. Breakdowns in communication or transport are possible."
  },
  {
    "start": "9 May 2026",
    "end": "11 May 2026",
    "strongest": "10 May 2026",
    "aspect": "Transiting Venus is Opposition your Natal Mercury",
    "description": "A little tact can go a long way during this period. There can be a risk of misunderstandings caused by moodiness or irritability."
  },
  {
    "start": "9 May 2026",
    "end": "10 May 2026",
    "strongest": "10 May 2026",
    "aspect": "Transiting Mercury is Trine your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "10 May 2026",
    "end": "11 May 2026",
    "strongest": "11 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Venus",
    "description": "A lack of drive or self-motivation is possible now. You may be more inclined to adopt a care-free attitude and treat yourself to little indulgences. Your thinking is more likely than not to be on love and romance, or play. Positively, you may demonstrate a talent for artistic creativity now."
  },
  {
    "start": "12 May 2026",
    "end": "13 May 2026",
    "strongest": "13 May 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "15 May 2026",
    "end": "31 August 2026",
    "strongest": "15 May 2026",
    "aspect": "Transiting Neptune is Square your Natal Jupiter",
    "description": "Of all the planets that Neptune can come into contact with, Jupiter is perhaps the most compatible. At their best together, Neptune and Jupiter can raise your spiritual awareness to higher levels and deepen your powers of compassion and empathy. Artistic creativity, also, can flourish under this influence - especially music, drama, dance and painting. At their worst, they can set you up for a fall by causing you to believe you can get away with just about anything. You may act on faith alone, conveniently overlooking the reality of a situation. For instance, this transit is often associated with speculation and gambling. This is one of the worst periods for pursuing risky financial ventures, because there is a danger of being duped and defrauded. Travel during this transit can be very worthwhile and uplifting; however, because of Neptune's tendency to make things appear other than they are, you should double-check all of your travel arrangements. One last word, avoid complicated legal procedures now, because you're not favoured to win."
  },
  {
    "start": "16 May 2026",
    "end": "16 May 2026",
    "strongest": "16 May 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "16 May 2026",
    "end": "21 May 2026",
    "strongest": "19 May 2026",
    "aspect": "Transiting Venus is Sextile Transiting Mars",
    "description": "Being in the mood for fun. Social spontaneity pays off. A romantic attraction is possible. Desire for love. Artistic creativity possible."
  },
  {
    "start": "17 May 2026",
    "end": "18 May 2026",
    "strongest": "17 May 2026",
    "aspect": "Transiting Mercury is Square your Natal Saturn",
    "description": "Your thinking and decision making processes tend to be slower than usual during this period. Your mind is occupied with serious or important matters. There can be miscommunications with others or transport problems and delays now."
  },
  {
    "start": "17 May 2026",
    "end": "18 May 2026",
    "strongest": "17 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Ascendant",
    "description": "Relations with others can either be very good or strained now. You may need to smooth out problem areas with other people. This is a good time to discuss things with your partner or to deal with consultants."
  },
  {
    "start": "17 May 2026",
    "end": "18 May 2026",
    "strongest": "17 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Sun",
    "description": "Communications with others take on a personal or subjective tone and they may not necessarily be harmonious. You may need to hold your tongue. There can be breakdowns in communication."
  },
  {
    "start": "17 May 2026",
    "end": "18 May 2026",
    "strongest": "18 May 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Uranus",
    "description": "Original and innovative thinking. New ideas and ways of doing things. The ability to think 'outside of the square'. Demonstrating intellectual flexibility and lateral thinking. Flashes of intuition. Modern and progressive outlooks. Revolution. Easy excitability and nervous tension. Sudden panic attacks. Doing too many things at once."
  },
  {
    "start": "17 May 2026",
    "end": "20 May 2026",
    "strongest": "19 May 2026",
    "aspect": "Transiting Mars is Trine your Natal Saturn",
    "description": "Hard work and long hours don't faze you now. In fact, you relish the idea of carrying a task or project through to a successful conclusion."
  },
  {
    "start": "18 May 2026",
    "end": "20 May 2026",
    "strongest": "19 May 2026",
    "aspect": "Transiting Venus is Sextile your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "18 May 2026",
    "end": "19 May 2026",
    "strongest": "19 May 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Neptune",
    "description": "A somewhat dreamy and romantic outlook. Power of presentiment. Inspired thinking. Artistic appreciation. Music, poetry, film and artistic creativity can flourish."
  },
  {
    "start": "19 May 2026",
    "end": "20 May 2026",
    "strongest": "19 May 2026",
    "aspect": "Transiting Mercury is Trine Transiting Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Sharp thinking and keen judgement. A critical mind. The power of persuasion."
  },
  {
    "start": "21 May 2026",
    "end": "22 May 2026",
    "strongest": "21 May 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Mars",
    "description": "During this period, you are intellectually sharp and able to talk yourself into and out of just about anything now. You can get things done now if you put mind to it."
  },
  {
    "start": "21 May 2026",
    "end": "23 May 2026",
    "strongest": "22 May 2026",
    "aspect": "Transiting Venus is Square Transiting Neptune",
    "description": "Unrealistic notions of love may cloud rational thinking during this period. There is a risk of being misunderstood, or of having romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "21 May 2026",
    "end": "23 May 2026",
    "strongest": "22 May 2026",
    "aspect": "Transiting Venus is Sextile your Natal Moon",
    "description": "This transit can create an agreeable and gentle atmosphere. Others seem more receptive to your emotional needs. Social activity within the home or with the family is easy and relaxing."
  },
  {
    "start": "22 May 2026",
    "end": "23 May 2026",
    "strongest": "22 May 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Jupiter",
    "description": "General feelings of happiness and joy commonly accompany this transit. You may be the recipient of gifts. At the very least, you should be able to expect that things go your way. Social events, travel and romantic matters are well-aspected. Artistic or creative successes are possible now."
  },
  {
    "start": "22 May 2026",
    "end": "23 May 2026",
    "strongest": "22 May 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Saturn",
    "description": "This is an excellent time for setting up a time-in-motion study. Tedious tasks won't seem so tedious now. Concentration is good and thinking is practical and realistic."
  },
  {
    "start": "23 May 2026",
    "end": "25 May 2026",
    "strongest": "24 May 2026",
    "aspect": "Transiting Mars is Conjunct your Natal Moon",
    "description": "Moodiness and irritability accompany this transit. Arguments or conflicts with others are likely. There could also be disruptions in your domestic life or disputes with family members. Watch out for accidents around the home. Disharmony between partners is possible."
  },
  {
    "start": "23 May 2026",
    "end": "24 May 2026",
    "strongest": "24 May 2026",
    "aspect": "Transiting Mercury is Square your Natal Midheaven",
    "description": "During this transit, your thoughts will simultaneously be on matters concerning your home and family and your career."
  },
  {
    "start": "23 May 2026",
    "end": "26 May 2026",
    "strongest": "25 May 2026",
    "aspect": "Transiting Mars is Sextile your Natal Jupiter",
    "description": "Other people are happy to co-operate with you over this period, because they can see your intentions are honourable. Business related matters, including personal transactions, are well-aspected now. Decide in your own mind what you want and go and get it."
  },
  {
    "start": "24 May 2026",
    "end": "25 May 2026",
    "strongest": "24 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Neptune",
    "description": "Your powers of judgement may prove to be faulty under this influence. You are prone to unrealistic thinking now and will have to guard against exposure to lies or deceptions. When communicating, you need to be very sure that others understand exactly what you mean, as there is a risk of misunderstandings."
  },
  {
    "start": "24 May 2026",
    "end": "25 May 2026",
    "strongest": "24 May 2026",
    "aspect": "Transiting Mercury is Trine your Natal Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Release information on \"a need to know basis\" when dealing with others."
  },
  {
    "start": "24 May 2026",
    "end": "27 May 2026",
    "strongest": "26 May 2026",
    "aspect": "Transiting Mars is Square Transiting Pluto",
    "description": "Powerful drives. Extreme efforts. The desire to dominate or to rule. The urge to change things, to eliminate and purify. High energy output. Negatively, there can be the tendency to act ruthlessly or brutally. Power struggles. Obsessions. Violence. Danger of accidents and injuries."
  },
  {
    "start": "26 May 2026",
    "end": "27 May 2026",
    "strongest": "26 May 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Mercury",
    "description": "Communicating with others may be difficult or irritating now; they are likely to challenge your views and opinions. Also, avoid making important decisions, if possible. There can be transport problems too."
  },
  {
    "start": "28 May 2026",
    "end": "30 May 2026",
    "strongest": "29 May 2026",
    "aspect": "Transiting Venus is Square Transiting Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed. An emotional separation is possible."
  },
  {
    "start": "29 May 2026",
    "end": "31 May 2026",
    "strongest": "30 May 2026",
    "aspect": "Transiting Venus is Trine your Natal Uranus",
    "description": "You are attracted to the idea of doing something different and exciting at the moment. It is a good time for snapping out of old patterns and routines. Perhaps a mild flirtation could give you a moment to remember?"
  },
  {
    "start": "29 May 2026",
    "end": "1 June 2026",
    "strongest": "31 May 2026",
    "aspect": "Transiting Mars is Square your Natal Mars",
    "description": "You have an excess of energy to burn at the moment. There is a tendency to act impulsively and rashly now, which can lead to accidents, injuries or conflicts with other people."
  },
  {
    "start": "30 May 2026",
    "end": "31 May 2026",
    "strongest": "31 May 2026",
    "aspect": "Transiting Venus is Sextile your Natal Midheaven",
    "description": "You are receptive to the finer things in life at the moment. If you are artistic, your creative powers may be enhanced now. Professional and domestic circumstances are harmonious now."
  },
  {
    "start": "31 May 2026",
    "end": "31 May 2026",
    "strongest": "31 May 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "31 May 2026",
    "end": "2 June 2026",
    "strongest": "1 June 2026",
    "aspect": "Transiting Venus is Square your Natal Pluto",
    "description": "At this time, there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Conflicts or power struggles in love are possible."
  },
  {
    "start": "1 June 2026",
    "end": "2 June 2026",
    "strongest": "1 June 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Saturn",
    "description": "This is a good time for attending to practical matters. You are able to plan well and to make arrangements. Your thinking is considered and realistic."
  },
  {
    "start": "1 June 2026",
    "end": "2 June 2026",
    "strongest": "1 June 2026",
    "aspect": "Transiting Venus is Trine your Natal Venus",
    "description": "There is a pleasant and relaxing quality to this period. You are more receptive to others now and people find you easy-going and approachable. Social get-togethers work well now. You may like to surround yourself with beauty or mix with artistic people."
  },
  {
    "start": "3 June 2026",
    "end": "4 June 2026",
    "strongest": "4 June 2026",
    "aspect": "Transiting Mercury is Square Transiting Neptune",
    "description": "The use of imagination. Thinking one thing and saying another. Misinterpreting things. Being at risk from deception or misrepresentation of facts. Need guard to against being exposed to lies or misunderstandings. Miscommunications. Faulty judgement. Unrealistic ideas."
  },
  {
    "start": "3 June 2026",
    "end": "4 June 2026",
    "strongest": "4 June 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Moon",
    "description": "You are more in touch with your own and others' feelings now. If you have anything on your mind you're unsure about, you should be able to find good listeners and advisers during this transit. This is a good decision making period."
  },
  {
    "start": "3 June 2026",
    "end": "5 June 2026",
    "strongest": "4 June 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Jupiter",
    "description": "The power of positive thinking makes anything possible now. Opportunities are there for the taking. Communications seem effortless and are bound to go well. A good time for taking short journeys. You are well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "4 June 2026",
    "end": "7 June 2026",
    "strongest": "5 June 2026",
    "aspect": "Transiting Mars is Opposition your Natal Uranus",
    "description": "Expect pressures and potential arguments caused by inner tensions or stress in either yourself or others. There is a danger of accidents or injuries during this period."
  },
  {
    "start": "5 June 2026",
    "end": "8 June 2026",
    "strongest": "7 June 2026",
    "aspect": "Transiting Mars is Trine your Natal Midheaven",
    "description": "You have increased self-motivation now, coupled with a definite sense of what you want to accomplish, be it on the home-front or in the professional area. The support of others is likely, as they recognise that you're clear about what you want to achieve."
  },
  {
    "start": "8 June 2026",
    "end": "11 June 2026",
    "strongest": "10 June 2026",
    "aspect": "Transiting Mars is Opposition your Natal Venus",
    "description": "This transit can bring about an intensification of passion and romantic fervour in you, which may or may not be reciprocated by another. Alternatively, the ardour of another could be directed at you. There may be arguments and disputes with loved ones caused by a lack of consideration or tactlessness. Selfishness in love is possible."
  },
  {
    "start": "8 June 2026",
    "end": "10 June 2026",
    "strongest": "9 June 2026",
    "aspect": "Transiting Venus is Conjunct Transiting Jupiter",
    "description": "General feelings of happiness and joy. Successes in love, art or social events. Expressions of warm-heartedness and generosity. Goodwill between people. Grand gestures and displays of affection. Party mood. Enjoying the moment. Smoothing out existing tensions. Giving and receiving gifts."
  },
  {
    "start": "9 June 2026",
    "end": "11 June 2026",
    "strongest": "10 June 2026",
    "aspect": "Transiting Mercury is Square Transiting Saturn",
    "description": "Serious and realistic thinking applies now, which at its best is practical, but at its worst, narrow and pessimistic. There can be miscommunications during this planetary influence, or transport problems and delays."
  },
  {
    "start": "9 June 2026",
    "end": "11 June 2026",
    "strongest": "10 June 2026",
    "aspect": "Transiting Mercury is Trine your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "10 June 2026",
    "end": "12 June 2026",
    "strongest": "11 June 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "10 June 2026",
    "end": "18 September 2026",
    "strongest": "29 July 2026",
    "aspect": "Transiting Pluto is Square your Natal Moon",
    "description": "During this transit, you will be subjected to intense emotional pressure, either through the surfacing of deep-seated feelings associated with your past, or through the influence of another whose presence causes you emotional turmoil in some way. Possibly, emotional, family or domestic circumstances will undergo transformation and upheaval. In certain cases, this may be a time for re-locating or changing residence. An influential woman in your life can have a profound effect on you at this time. There is the potential for emotionally charged power struggles, coupled with issues of emotional control and dominance. Emotional relationships, in particular, can come under pressure now, and those that are already shaky can break up completely. Positively, this transit can enable you to clear out or purge any aspects of your emotional life that limit or restrict you."
  },
  {
    "start": "11 June 2026",
    "end": "30 October 2026",
    "strongest": "25 July 2026",
    "aspect": "Transiting Neptune is Sextile Transiting Pluto",
    "description": "An enthusiasm for mystical experiences. The inclination to delve deeply into - and to explore - the inner or spiritual dimensions of life."
  },
  {
    "start": "11 June 2026",
    "end": "13 June 2026",
    "strongest": "12 June 2026",
    "aspect": "Transiting Mercury is Square your Natal Pluto",
    "description": "You are as sharp as a tack during this period and have the ability to influence others through persuasive speaking or writing. However, if you express extreme or fanatical opinions you will tend to turn people off."
  },
  {
    "start": "12 June 2026",
    "end": "14 June 2026",
    "strongest": "13 June 2026",
    "aspect": "Transiting Mercury is Trine your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "13 June 2026",
    "end": "14 June 2026",
    "strongest": "13 June 2026",
    "aspect": "Transiting Venus is Trine your Natal Ascendant",
    "description": "This transit creates a light-hearted and easy-going atmosphere. You should enjoy good relations with others at the moment."
  },
  {
    "start": "13 June 2026",
    "end": "15 June 2026",
    "strongest": "14 June 2026",
    "aspect": "Transiting Venus is Trine your Natal Sun",
    "description": "This transit can make for a pleasant and easy-going interval. People around you are obliging and courteous. You tend to feel good about yourself and your appearance. Social occasions are enjoyable now."
  },
  {
    "start": "15 June 2026",
    "end": "16 June 2026",
    "strongest": "15 June 2026",
    "aspect": "Transiting Venus is Sextile Transiting Uranus",
    "description": "Being attracted to the idea of doing something different and exciting. It is a time for snapping out of old patterns and routines. A mild flirtation could bring a smile to the face."
  },
  {
    "start": "15 June 2026",
    "end": "15 June 2026",
    "strongest": "15 June 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "16 June 2026",
    "end": "17 June 2026",
    "strongest": "17 June 2026",
    "aspect": "Transiting Venus is Square your Natal Moon",
    "description": "The only thing that might spoil this period is irritability - your own or another's. There may be friction in the home or family, or with women."
  },
  {
    "start": "16 June 2026",
    "end": "18 June 2026",
    "strongest": "17 June 2026",
    "aspect": "Transiting Venus is Trine Transiting Neptune",
    "description": "This combination can increase the receptivity to beauty, art and music. The finer things in life appeal now, and creative or artistic imagination and inspiration are likely to be enhanced."
  },
  {
    "start": "17 June 2026",
    "end": "18 June 2026",
    "strongest": "17 June 2026",
    "aspect": "Transiting Venus is Opposition Transiting Pluto",
    "description": "At this time there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Amorous excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "18 June 2026",
    "end": "20 June 2026",
    "strongest": "18 June 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Mars",
    "description": "Determining priorities and pushing them through with vigour and decisive action. Intellectually sharp and articulate. Having the power to supply a ready answer when challenged and to effectively convince others of own ideas."
  },
  {
    "start": "20 June 2026",
    "end": "22 June 2026",
    "strongest": "21 June 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Mars",
    "description": "Your passions are strong at present. You are motivated to realise your desires or creative powers now."
  },
  {
    "start": "24 June 2026",
    "end": "25 June 2026",
    "strongest": "24 June 2026",
    "aspect": "Transiting Venus is Square your Natal Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "24 June 2026",
    "end": "6 August 2026",
    "strongest": "15 July 2026",
    "aspect": "Transiting Uranus is Sextile Transiting Neptune",
    "description": "The tendency to turn attention inward and investigate spiritual matters. A longing for inner understanding and illumination. Scientific inspirations and breakthroughs. Social change. Rise in New Age thinking. Artistic inspiration. New directions and experimentation in art and music. New entertainment forms."
  },
  {
    "start": "24 June 2026",
    "end": "26 June 2026",
    "strongest": "25 June 2026",
    "aspect": "Transiting Venus is Trine Transiting Saturn",
    "description": "This can be a good time to re-define responsibilities and boundary lines in personal relationships. The head rules the heart and common sense prevails in romance. Serious or practical art forms."
  },
  {
    "start": "25 June 2026",
    "end": "27 June 2026",
    "strongest": "26 June 2026",
    "aspect": "Transiting Venus is Trine your Natal Neptune",
    "description": "This transit can increase your receptivity to beauty, art and music. The finer things in life have an appeal now and, if you are creative or artistic, your powers of imagination and inspiration are likely to be enhanced now."
  },
  {
    "start": "26 June 2026",
    "end": "30 June 2026",
    "strongest": "28 June 2026",
    "aspect": "Transiting Mars is Sextile Transiting Jupiter",
    "description": "Business related matters, including personal transactions, are well-aspected now. Acting with integrity and a sense of purpose. Successful physical or martial activity. The ability to settle disputes amicably. A sense of honour."
  },
  {
    "start": "26 June 2026",
    "end": "28 June 2026",
    "strongest": "27 June 2026",
    "aspect": "Transiting Venus is Sextile your Natal Pluto",
    "description": "This transit can make you aware of subtle undercurrents and possible attraction between you and another. Acknowledge any feelings you may have, but avoid trying to manipulate situations."
  },
  {
    "start": "26 June 2026",
    "end": "28 June 2026",
    "strongest": "27 June 2026",
    "aspect": "Transiting Venus is Square your Natal Venus",
    "description": "Little annoyances could spoil what can be an otherwise pleasant period, if you're not careful. You should try to make every effort to get on with others and not to react to situations or provocations."
  },
  {
    "start": "27 June 2026",
    "end": "30 June 2026",
    "strongest": "29 June 2026",
    "aspect": "Transiting Mars is Square your Natal Saturn",
    "description": "During this period, your life seems to be moving at the rate of one step forward and one step backwards. You feel like you're driving with the handbrake on. Everything takes a lot of effort at the moment. Also, there is a strong risk of accidents or conflicts with others now, so take care."
  },
  {
    "start": "27 June 2026",
    "end": "7 July 2026",
    "strongest": "2 July 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Ascendant",
    "description": "This is likely to be a pleasant period in your life with respect to social activity and meeting people. Contacts are made effortlessly and, in some circumstances, new relationships or long-lasting friendships are formed now."
  },
  {
    "start": "28 June 2026",
    "end": "30 June 2026",
    "strongest": "29 June 2026",
    "aspect": "Transiting Mars is Opposition your Natal Ascendant",
    "description": "Conflicts and disputes with other people can be a problem during this period. Others can seem aggressive and confrontational right now. Be ready to assert yourself and don't compromise if you feel strongly about something. There can be conflicts with partners."
  },
  {
    "start": "28 June 2026",
    "end": "1 July 2026",
    "strongest": "30 June 2026",
    "aspect": "Transiting Mars is Opposition your Natal Sun",
    "description": "You have a desire to achieve things now, coupled with the drive to succeed. Expect an energy boost, but guard against over-exerting yourself physically, as it could lead to stress and strain. There is a risk of injury-proneness or conflicts with others."
  },
  {
    "start": "29 June 2026",
    "end": "1 July 2026",
    "strongest": "30 June 2026",
    "aspect": "Transiting Venus is Trine your Natal Mercury",
    "description": "During this transit, you express a pleasant and cordial manner that others find attractive. Social affairs are easily arranged and staged now."
  },
  {
    "start": "29 June 2026",
    "end": "9 July 2026",
    "strongest": "4 July 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Sun",
    "description": "This should be a comparatively relaxed and harmonious period for you. Whatever you want to achieve at this time you will. However, your successes now are equivalent to the efforts you put in. A problem is that you may be inclined to just kick back and enjoy the feeling of contentment associated with this transit. Travel, business or financial matters can all be beneficial now, if other factors support these. Also, you are presently well-aspected for making contacts with people who can help you socially or professionally."
  },
  {
    "start": "29 June 2026",
    "end": "29 June 2026",
    "strongest": "29 June 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "2 July 2026",
    "end": "5 July 2026",
    "strongest": "4 July 2026",
    "aspect": "Transiting Mars is Conjunct Transiting Uranus",
    "description": "A high-risk interval caused by impatience and potential hot-headedness. A danger of accident proneness, mechanical failure and violence. Displays of accentuated individualism and the urge to get one's own way. Explosions and outbursts. The desire to make things happen, to force changes. Take care travelling or when around machinery and volatile materials."
  },
  {
    "start": "3 July 2026",
    "end": "4 August 2026",
    "strongest": "18 July 2026",
    "aspect": "Transiting Uranus is Trine Transiting Pluto",
    "description": "Reforms and innovations successfully introduced. Technological breakthroughs and advancements. Mass technology. Sense of purpose. Urge to liberate and be liberated. Bringing the new into being."
  },
  {
    "start": "3 July 2026",
    "end": "6 July 2026",
    "strongest": "5 July 2026",
    "aspect": "Transiting Mars is Sextile Transiting Neptune",
    "description": "Physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. It may be a good time to go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "3 July 2026",
    "end": "18 August 2026",
    "strongest": "3 July 2026",
    "aspect": "Transiting Saturn is Trine your Natal Neptune",
    "description": "Spiritually, this can be a very enriching time, particularly if you are generally quite self-possessed and secure. Positively, this is a good time for being of service to others and concentrating on spiritual development. Your interest in metaphysical subjects and religion may increase now and there is the possibility that you could have psychic experiences. You can make your dreams a reality through hard work and self-discipline now."
  },
  {
    "start": "4 July 2026",
    "end": "6 July 2026",
    "strongest": "5 July 2026",
    "aspect": "Transiting Mars is Trine Transiting Pluto",
    "description": "Daring to make radical changes. Having the power to push through reforms and to transform situations. Record efforts are possible; however overdoing things can lead to exhaustion."
  },
  {
    "start": "9 July 2026",
    "end": "10 July 2026",
    "strongest": "9 July 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Saturn",
    "description": "During this transit, your head tends to rule your heart. You may feel emotionally restrained now and there can be difficulties in relationships with people you care about. A feeling of distance may exist between you and another."
  },
  {
    "start": "9 July 2026",
    "end": "11 July 2026",
    "strongest": "10 July 2026",
    "aspect": "Transiting Venus is Square your Natal Ascendant",
    "description": "You have the power to draw others to you and to make a good impression on people. Your relations with other people are better than usual and your social calendar is likely to be quite full. However, there can be tensions with others caused through vanity or inconsiderateness."
  },
  {
    "start": "9 July 2026",
    "end": "11 July 2026",
    "strongest": "10 July 2026",
    "aspect": "Transiting Venus is Square your Natal Sun",
    "description": "During this transit, you enjoy socialising and indulging yourself. You may amuse yourself with passing flirtations. You are not likely to be very productive now, but does it matter? There can be minor tensions with loved ones."
  },
  {
    "start": "10 July 2026",
    "end": "13 July 2026",
    "strongest": "11 July 2026",
    "aspect": "Transiting Mars is Sextile your Natal Mars",
    "description": "You can expect an energy boost now, coupled with an increase in self-motivation. This is an excellent transit for getting things done, or for participating in sport or some form of physical exercise."
  },
  {
    "start": "12 July 2026",
    "end": "14 July 2026",
    "strongest": "13 July 2026",
    "aspect": "Transiting Venus is Trine your Natal Moon",
    "description": "This transit can create an agreeable and gentle atmosphere. Others seem more receptive to your emotional needs. Social activity within the home or with the family is easy and relaxing."
  },
  {
    "start": "12 July 2026",
    "end": "14 July 2026",
    "strongest": "13 July 2026",
    "aspect": "Transiting Venus is Square Transiting Uranus",
    "description": "Anticipate a period of instant attractions, coupled with the tendency to fall in and out of love suddenly. Unstable relationships will be tested now and break ups are possible. Expect the unexpected in love."
  },
  {
    "start": "13 July 2026",
    "end": "14 July 2026",
    "strongest": "13 July 2026",
    "aspect": "Transiting Venus is Sextile your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "14 July 2026",
    "end": "14 July 2026",
    "strongest": "14 July 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "15 July 2026",
    "end": "24 July 2026",
    "strongest": "19 July 2026",
    "aspect": "Transiting Jupiter is Square your Natal Moon",
    "description": "In general, the so-called hard transits involving Jupiter are not difficult. You feel more emotionally secure and optimistic than usual and can express your feelings to others more easily. Family and domestic matters seem to go well at this time and buying or selling real-estate, or moving home is favoured under this transit. Even if you don't move house or invest in property, this is an excellent time for making improvements to your home, such as alterations and redecorating. On the personal front, you can expect to relate well to people; you will seem to have an instinct for others' needs. Women, in particular, can be beneficial in your life at the moment. This is one of the best times for travelling overseas, or having visitors from far-off places come to stay."
  },
  {
    "start": "15 July 2026",
    "end": "24 July 2026",
    "strongest": "20 July 2026",
    "aspect": "Transiting Jupiter is Trine Transiting Neptune",
    "description": "Receptivity to foreign ideas and beliefs. Increased travel and interest in spiritual or religious matters. A flourishing of the arts. Inspiration. Intuition. Compassion and generosity."
  },
  {
    "start": "15 July 2026",
    "end": "26 July 2026",
    "strongest": "21 July 2026",
    "aspect": "Transiting Jupiter is Sextile Transiting Uranus",
    "description": "Implementing reforms easily. Bringing the new into being successfully. Forward thinking. Understanding things well. Good powers of comprehension. Revolutions in travel. The inclination to take risks or gamble."
  },
  {
    "start": "16 July 2026",
    "end": "24 July 2026",
    "strongest": "20 July 2026",
    "aspect": "Transiting Jupiter is Opposition Transiting Pluto",
    "description": "The urge to exercise power over others. Increased power of assertion. Making a statement, by force if necessary. Actions that impact on society at large. Power struggles based on philosophical or ideological differences. The desire for power and dominance. Disasters caused through over-estimating abilities. Crime wave. Religious fanaticism. Escalation of violence."
  },
  {
    "start": "17 July 2026",
    "end": "20 July 2026",
    "strongest": "19 July 2026",
    "aspect": "Transiting Mars is Square your Natal Midheaven",
    "description": "You have increased self-motivation now, coupled with a definite sense of what you want to accomplish, be it on the home-front or in the professional area. Tensions and conflicts are likely in the home and career, however."
  },
  {
    "start": "18 July 2026",
    "end": "21 July 2026",
    "strongest": "19 July 2026",
    "aspect": "Transiting Mars is Sextile Transiting Saturn",
    "description": "Being unfazed by hard work and long hours. Disciplined action and energy. The ability to carry a task or project through to a successful conclusion. Willpower and determination. The power of endurance."
  },
  {
    "start": "18 July 2026",
    "end": "28 July 2026",
    "strongest": "22 July 2026",
    "aspect": "Transiting Mercury is Trine your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "19 July 2026",
    "end": "22 July 2026",
    "strongest": "20 July 2026",
    "aspect": "Transiting Mars is Opposition your Natal Neptune",
    "description": "Anticipate a period of fluctuating energy levels, with a tendency towards feeling washed out or physically depleted. You are in danger of misdirecting your energies or misusing your power now. Escapist tendencies are quite strong now."
  },
  {
    "start": "19 July 2026",
    "end": "22 July 2026",
    "strongest": "21 July 2026",
    "aspect": "Transiting Mars is Trine your Natal Pluto",
    "description": "During this transit, you may dare to transform something about yourself; your appearance, personal surroundings or your relationship with another or group of people. You can achieve results now through perseverance and persistence."
  },
  {
    "start": "20 July 2026",
    "end": "27 July 2026",
    "strongest": "20 July 2026",
    "aspect": "Transiting Mercury is Square your Natal Pluto",
    "description": "You are as sharp as a tack during this period and have the ability to influence others through persuasive speaking or writing. However, if you express extreme or fanatical opinions you will tend to turn people off."
  },
  {
    "start": "20 July 2026",
    "end": "22 July 2026",
    "strongest": "21 July 2026",
    "aspect": "Transiting Venus is Sextile your Natal Uranus",
    "description": "You are attracted to the idea of doing something different and exciting at the moment. It is a good time for snapping out of old patterns and routines. Perhaps a mild flirtation could give you a moment to remember?"
  },
  {
    "start": "21 July 2026",
    "end": "23 July 2026",
    "strongest": "22 July 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Midheaven",
    "description": "If you are artistic or creative, this is one of the best transits for receiving recognition and acknowledgement. Success in love is possible now."
  },
  {
    "start": "22 July 2026",
    "end": "24 July 2026",
    "strongest": "23 July 2026",
    "aspect": "Transiting Venus is Square your Natal Neptune",
    "description": "Watch out! Unrealistic notions of love may cloud your thinking during this period. There is a risk of being misunderstood, or of having your romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "23 July 2026",
    "end": "25 July 2026",
    "strongest": "24 July 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Venus",
    "description": "Communications with friends, loved ones and even strangers have a natural flow to them over this period. A courteous and pleasant manner can win friends and influence people. This can be a good time for socialising, or for discussing matters of the heart, or art."
  },
  {
    "start": "23 July 2026",
    "end": "25 July 2026",
    "strongest": "24 July 2026",
    "aspect": "Transiting Venus is Sextile your Natal Venus",
    "description": "There is a pleasant and relaxing quality to this period. You are more receptive to others now and people find you easy-going and approachable. Social get-togethers work well now. You may like to surround yourself with beauty or mix with artistic people."
  },
  {
    "start": "25 July 2026",
    "end": "28 July 2026",
    "strongest": "27 July 2026",
    "aspect": "Transiting Mars is Opposition your Natal Mercury",
    "description": "There is a force and a power in your communications at the moment. You feel like telling people exactly what's on your mind. There is a danger of arguments and disputes, or hasty words and actions. Impatience can result in bad decisions or accidents."
  },
  {
    "start": "26 July 2026",
    "end": "1 August 2026",
    "strongest": "29 July 2026",
    "aspect": "Transiting Venus is Square Transiting Mars",
    "description": "During this period passions run hot and feelings between people are intense and unpredictable. Tendency to come on too strongly in love or sex. Infidelity. Acts of violence are possible due to heated emotions. (A love of war-like activity)."
  },
  {
    "start": "26 July 2026",
    "end": "28 July 2026",
    "strongest": "27 July 2026",
    "aspect": "Transiting Venus is Square your Natal Mercury",
    "description": "A little tact can go a long way during this period. There can be a risk of misunderstandings caused by moodiness or irritability."
  },
  {
    "start": "29 July 2026",
    "end": "29 July 2026",
    "strongest": "29 July 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "6 August 2026",
    "end": "8 August 2026",
    "strongest": "7 August 2026",
    "aspect": "Transiting Venus is Sextile your Natal Ascendant",
    "description": "This transit creates a light-hearted and easy-going atmosphere. You should enjoy good relations with others at the moment."
  },
  {
    "start": "6 August 2026",
    "end": "8 August 2026",
    "strongest": "7 August 2026",
    "aspect": "Transiting Venus is Sextile your Natal Sun",
    "description": "This transit can make for a pleasant and easy-going interval. People around you are obliging and courteous. You tend to feel good about yourself and your appearance. Social occasions are enjoyable now."
  },
  {
    "start": "6 August 2026",
    "end": "15 August 2026",
    "strongest": "11 August 2026",
    "aspect": "Transiting Jupiter is Conjunct your Natal Mars",
    "description": "During this period, you have the capability to achieve a lot if you put your mind to it. You have increased energy, coupled with a strong desire to accomplish great things. You are motivated by the urge to live life as fully and productively as you can, because you have more drive and determination than usual now. This is an excellent business period, or time for initiating enterprises and starting new projects. It is also one of the best transits possible for making decisions and negotiating deals in your favour. Truly, it is the combination of the successful manager or entrepreneur. The only thing you need to be aware of is a tendency to take on more than you can comfortably handle or to over-estimate your physical powers. If you are sports oriented, this transit can improve your game and take you to another level of fitness. The main feature of this transit is \"successful action\". Take advantage of it, as it only comes around once every 12 years."
  },
  {
    "start": "9 August 2026",
    "end": "10 August 2026",
    "strongest": "9 August 2026",
    "aspect": "Transiting Mercury is Trine your Natal Ascendant",
    "description": "Communications with others should go well now. You can take part in important discussions or small talk with equal skill."
  },
  {
    "start": "9 August 2026",
    "end": "10 August 2026",
    "strongest": "10 August 2026",
    "aspect": "Transiting Mercury is Trine your Natal Sun",
    "description": "Anticipate an intellectually stimulating interval, with all sorts of people trying to get in touch with you. A good time for doing mental work and for catching up on outstanding paperwork."
  },
  {
    "start": "9 August 2026",
    "end": "11 August 2026",
    "strongest": "10 August 2026",
    "aspect": "Transiting Venus is Trine Transiting Pluto",
    "description": "Becoming aware of hidden attractions. Being drawn to another as if by some kind of inner compulsion. Intensification of passion."
  },
  {
    "start": "9 August 2026",
    "end": "11 August 2026",
    "strongest": "10 August 2026",
    "aspect": "Transiting Venus is Opposition Transiting Neptune",
    "description": "Unrealistic notions of love may cloud rational thinking during this period. There is a risk of being misunderstood, or of having romantic hopes dashed. Artistic creativity, however, is enhanced."
  },
  {
    "start": "10 August 2026",
    "end": "13 August 2026",
    "strongest": "11 August 2026",
    "aspect": "Transiting Mars is Sextile your Natal Saturn",
    "description": "Hard work and long hours don't faze you now. In fact, you relish the idea of carrying a task or project through to a successful conclusion."
  },
  {
    "start": "10 August 2026",
    "end": "12 August 2026",
    "strongest": "11 August 2026",
    "aspect": "Transiting Venus is Square your Natal Jupiter",
    "description": "Party time! The desire to socialise and to indulge the senses is accentuated now. Just don't overdo it, because your body won't thank you afterwards. Self-indulgent tendencies are strong now. Travelling during this transit may not be enjoyable."
  },
  {
    "start": "11 August 2026",
    "end": "13 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Transiting Venus is Trine Transiting Uranus",
    "description": "Being attracted to the idea of doing something different and exciting. It is a time for snapping out of old patterns and routines. A mild flirtation could bring a smile to the face."
  },
  {
    "start": "11 August 2026",
    "end": "12 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Transiting Mercury is Opposition Transiting Pluto",
    "description": "Intellectual powers and comprehension are as sharp as a tack during this period and the capability to exercise an influence over others through persuasive speaking or writing is accentuated. However, expressing extremist or fanatical opinions will tend to turn people off. Mental troubles. Paranoia. Cunning and craft."
  },
  {
    "start": "11 August 2026",
    "end": "12 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Transiting Mercury is Trine Transiting Neptune",
    "description": "A somewhat dreamy and romantic outlook. Power of presentiment. Inspired thinking. Artistic appreciation. Music, poetry, film and artistic creativity can flourish."
  },
  {
    "start": "11 August 2026",
    "end": "12 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Transiting Mercury is Square your Natal Moon",
    "description": "Reason and emotion may be at odds with each other at the moment and communications with others, especially females or family members, could be tense. Try and be up-front with people, as this can help to avoid misunderstandings."
  },
  {
    "start": "12 August 2026",
    "end": "13 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Uranus",
    "description": "Reliable intuition. Original ideas and flashes of inspiration can be expected. Demonstrating intellectual flexibility and lateral thinking. Keen powers of observation."
  },
  {
    "start": "12 August 2026",
    "end": "14 August 2026",
    "strongest": "13 August 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Venus",
    "description": "Communications with friends, loved ones and even strangers have a natural flow to them over this period. A courteous and pleasant manner can win friends and influence people. This can be a good time for socialising, or for discussing matters of the heart, or art."
  },
  {
    "start": "12 August 2026",
    "end": "12 August 2026",
    "strongest": "12 August 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "12 August 2026",
    "end": "12 August 2026",
    "strongest": "12 August 2026",
    "aspect": "Solar Eclipse",
    "description": ""
  },
  {
    "start": "14 August 2026",
    "end": "15 August 2026",
    "strongest": "14 August 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Mars",
    "description": "Under this influence you have the power to supply a ready answer when challenged and to effectively convince others of your own ideas. However, you may be inclined to jump to conclusions and voice your opinions, before you've really thought them through. Arguments are likely."
  },
  {
    "start": "14 August 2026",
    "end": "16 August 2026",
    "strongest": "15 August 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Jupiter",
    "description": "Positive thinking. Good judgement. Communications seem effortless and are bound to go well. Interest in learning or teaching. This is an excellent time for making important decisions. Opportunities for the taking. A confident, if at times, over-confident attitude. Having an appreciation of the big picture, yet being inclined to overlook small and important details. Danger from lazy or negligent thinking."
  },
  {
    "start": "15 August 2026",
    "end": "17 August 2026",
    "strongest": "16 August 2026",
    "aspect": "Transiting Venus is Sextile your Natal Mars",
    "description": "You are in the mood for fun at the moment. Be socially spontaneous. A night out could be just what you need to relax."
  },
  {
    "start": "15 August 2026",
    "end": "18 August 2026",
    "strongest": "17 August 2026",
    "aspect": "Transiting Mars is Square Transiting Neptune",
    "description": "Fluctuating energy levels, with a tendency to feel washed out or physically depleted. Wanting something but not feeling inclined to make the necessary effort. The urge to escape. Fluctuating energies or a lack of drive. A weak will or character. A danger of being a pushover. A risk of illness and infection. Danger from inflammable substances."
  },
  {
    "start": "16 August 2026",
    "end": "19 August 2026",
    "strongest": "17 August 2026",
    "aspect": "Transiting Mars is Sextile your Natal Moon",
    "description": "Allow your instincts to guide you in your actions during this period, and trust them when assessing the actions of others. This is a good time for doing things around the home or with your family."
  },
  {
    "start": "16 August 2026",
    "end": "19 August 2026",
    "strongest": "17 August 2026",
    "aspect": "Transiting Venus is Sextile Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "16 August 2026",
    "end": "17 August 2026",
    "strongest": "17 August 2026",
    "aspect": "Transiting Mercury is Square your Natal Uranus",
    "description": "Expressing either original or eccentric ideas or actions now will get you noticed. You could have some difficulties appreciating other people's points of view, due to self-willed or inflexible thinking. Breakdowns in communication or transport are possible."
  },
  {
    "start": "16 August 2026",
    "end": "20 August 2026",
    "strongest": "18 August 2026",
    "aspect": "Transiting Mars is Conjunct your Natal Jupiter",
    "description": "This is one of the best transits for business activity. Negotiating and dealing with contractual matters succeed now. Your ability to recognise an opportunity and your sense of timing are in sync at the moment."
  },
  {
    "start": "17 August 2026",
    "end": "18 August 2026",
    "strongest": "17 August 2026",
    "aspect": "Transiting Mercury is Trine Transiting Saturn",
    "description": "This is an excellent time for setting up a time-in-motion study. Tedious tasks won't seem so tedious now. Concentration is good and thinking is practical and realistic."
  },
  {
    "start": "17 August 2026",
    "end": "18 August 2026",
    "strongest": "18 August 2026",
    "aspect": "Transiting Mercury is Trine your Natal Neptune",
    "description": "A somewhat dreamy and romantic mood influences your thinking at the moment. You are at risk of being mentally lax and careless now, but equally, there is the possibility of inspired and imaginative thinking too. Music, poetry, film and artistic creativity can flourish during this transit."
  },
  {
    "start": "17 August 2026",
    "end": "18 August 2026",
    "strongest": "18 August 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Release information on \"a need to know basis\" when dealing with others."
  },
  {
    "start": "18 August 2026",
    "end": "19 August 2026",
    "strongest": "18 August 2026",
    "aspect": "Transiting Mercury is Square your Natal Venus",
    "description": "A lack of drive or self-motivation is possible now. You may be more inclined to adopt a care-free attitude and treat yourself to little indulgences. Your thinking is more likely than not to be on love and romance, or play. Positively, you may demonstrate a talent for artistic creativity now."
  },
  {
    "start": "19 August 2026",
    "end": "20 August 2026",
    "strongest": "20 August 2026",
    "aspect": "Transiting Mercury is Trine your Natal Mercury",
    "description": "This is an excellent time for all types of communication. You can present your ideas or arguments well now. Business decisions and short distance travel are well-aspected."
  },
  {
    "start": "20 August 2026",
    "end": "22 August 2026",
    "strongest": "21 August 2026",
    "aspect": "Transiting Venus is Opposition Transiting Saturn",
    "description": "The inclinations of the heart take second place to responsibility and duty. Spontaneous expressions of affection just don't happen now. Feelings are kept in check. Any difficulties in love will tend to be revealed. An emotional separation is possible."
  },
  {
    "start": "21 August 2026",
    "end": "23 August 2026",
    "strongest": "22 August 2026",
    "aspect": "Transiting Venus is Sextile your Natal Neptune",
    "description": "This transit can increase your receptivity to beauty, art and music. The finer things in life have an appeal now and, if you are creative or artistic, your powers of imagination and inspiration are likely to be enhanced now."
  },
  {
    "start": "22 August 2026",
    "end": "24 August 2026",
    "strongest": "23 August 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Pluto",
    "description": "Passions are intensified over this period and any hidden feelings or problems in love are likely to come out into the open now. Emotional intensity is obvious and you can become fixated on achieving personal desires. Transformation in love is likely."
  },
  {
    "start": "25 August 2026",
    "end": "26 August 2026",
    "strongest": "25 August 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Saturn",
    "description": "Your thinking takes on a somewhat sombre and serious tone during this transit. Hard or unpopular decisions may be required to be made, and communications with others tend to be more difficult than usual."
  },
  {
    "start": "25 August 2026",
    "end": "26 August 2026",
    "strongest": "25 August 2026",
    "aspect": "Transiting Mercury is Square your Natal Ascendant",
    "description": "Your personal environment is likely to be very busy now, with many communications and conversations with others. However, a word out of place or a rash decision could cause heated arguments."
  },
  {
    "start": "25 August 2026",
    "end": "3 September 2026",
    "strongest": "29 August 2026",
    "aspect": "Transiting Jupiter is Square your Natal Uranus",
    "description": "Expect the unexpected with this transit, but don't presuppose that what you experience will necessarily be to your liking, because any transit involving Uranus is going to be unpredictable. Positively, this is a period in which sudden opportunities could present themselves and offer you the chance to break out of old routines and experience new things. For instance, you may have to suddenly contend with new conditions in your work, or you meet someone who influences you profoundly. Some people even have sudden financial windfalls or the chance to travel. Definitely, you will want to make changes for the better under this influence and you should receive plenty of signals, by way of intuitive flashes, as to how to do this. Occasionally, this transit is preceded by an intense feeling of tension which suddenly releases when it becomes exact. One word of caution, you could annoy others and consequently miss good opportunities now, if you display an intolerant attitude or contradict people for the sake of it. Legal matters are best avoided now, if possible, as their outcome is difficult to predict. In fact, if conflicts of any description do arise, it is in your best interests to try and nip them in the bud, lest they become exaggerated out of all proportion."
  },
  {
    "start": "25 August 2026",
    "end": "26 August 2026",
    "strongest": "25 August 2026",
    "aspect": "Transiting Mercury is Square your Natal Sun",
    "description": "Communications with others take on a personal or subjective tone and they may not necessarily be harmonious. You may need to hold your tongue. There can be breakdowns in communication."
  },
  {
    "start": "26 August 2026",
    "end": "29 August 2026",
    "strongest": "27 August 2026",
    "aspect": "Transiting Venus is Sextile your Natal Mercury",
    "description": "During this transit, you express a pleasant and cordial manner that others find attractive. Social affairs are easily arranged and staged now."
  },
  {
    "start": "27 August 2026",
    "end": "28 August 2026",
    "strongest": "27 August 2026",
    "aspect": "Transiting Mercury is Trine your Natal Moon",
    "description": "You are more in touch with your own and others' feelings now. If you have anything on your mind you're unsure about, you should be able to find good listeners and advisers during this transit. This is a good decision making period."
  },
  {
    "start": "27 August 2026",
    "end": "28 August 2026",
    "strongest": "27 August 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Jupiter",
    "description": "Positive thinking makes anything possible now. This is a good transit for communicating your ideas to others, making decisions and undertaking short journeys."
  },
  {
    "start": "27 August 2026",
    "end": "28 August 2026",
    "strongest": "28 August 2026",
    "aspect": "Transiting Mercury is Square Transiting Uranus",
    "description": "Expressing either original or eccentric ideas. May be difficulties appreciating another's point of view, due to rigid or inflexible thinking. Easy excitability and nervous tension. Breakdowns in communication or transport are possible."
  },
  {
    "start": "28 August 2026",
    "end": "4 September 2026",
    "strongest": "31 August 2026",
    "aspect": "Transiting Jupiter is Trine Transiting Saturn",
    "description": "Balance between expansion and consolidation. Successes through patience and hard work. Financial stability. Rise in property values. Quiet optimism and business confidence."
  },
  {
    "start": "28 August 2026",
    "end": "28 August 2026",
    "strongest": "28 August 2026",
    "aspect": "Lunar Eclipse",
    "description": ""
  },
  {
    "start": "28 August 2026",
    "end": "28 August 2026",
    "strongest": "28 August 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "30 August 2026",
    "end": "2 September 2026",
    "strongest": "31 August 2026",
    "aspect": "Transiting Mars is Trine your Natal Uranus",
    "description": "This transit can inspire you to try something new or out the ordinary. It increases your courage to experiment or to introduce reforms. You can make changes now."
  },
  {
    "start": "30 August 2026",
    "end": "2 September 2026",
    "strongest": "1 September 2026",
    "aspect": "Transiting Mars is Square Transiting Saturn",
    "description": "The power of endurance. Progressing at the rate of two steps forward and one step backward; like driving with the handbrake on. A risk of accidents or injuries. Illness. Acts of violence. War-like behaviour. Destructiveness. Separations and losses."
  },
  {
    "start": "31 August 2026",
    "end": "2 September 2026",
    "strongest": "1 September 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Mars",
    "description": "Determining priorities and pushing them through with vigour and decisive action. Intellectually sharp and articulate. Having the power to supply a ready answer when challenged and to effectively convince others of own ideas."
  },
  {
    "start": "31 August 2026",
    "end": "1 September 2026",
    "strongest": "1 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Uranus",
    "description": "Trust your intuition at the moment, as it is especially acute. Original ideas and flashes of inspiration can be expected. You may become aware of some new and useful information, which puts a different slant on things."
  },
  {
    "start": "31 August 2026",
    "end": "3 September 2026",
    "strongest": "2 September 2026",
    "aspect": "Transiting Mars is Sextile your Natal Midheaven",
    "description": "You have increased self-motivation now, coupled with a definite sense of what you want to accomplish, be it on the home-front or in the professional area. The support of others is likely, as they recognise that you're clear about what you want to achieve."
  },
  {
    "start": "1 September 2026",
    "end": "2 September 2026",
    "strongest": "1 September 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Midheaven",
    "description": "Your thoughts are likely to be on your career or direction in life. You can make good decisions regarding these areas now."
  },
  {
    "start": "1 September 2026",
    "end": "2 September 2026",
    "strongest": "2 September 2026",
    "aspect": "Transiting Mercury is Square your Natal Neptune",
    "description": "Your powers of judgement may prove to be faulty under this influence. You are prone to unrealistic thinking now and will have to guard against exposure to lies or deceptions. When communicating, you need to be very sure that others understand exactly what you mean, as there is a risk of misunderstandings."
  },
  {
    "start": "2 September 2026",
    "end": "3 September 2026",
    "strongest": "3 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Venus",
    "description": "Social interaction and communication with others is easy under this influence. A courteous and pleasant manner can win friends and influence people. This can be a good time for discussing matters of the heart, or art and creativity. Short journeys tend to go well now."
  },
  {
    "start": "3 September 2026",
    "end": "6 September 2026",
    "strongest": "4 September 2026",
    "aspect": "Transiting Mars is Square your Natal Pluto",
    "description": "You feel driven and compelled to achieve a lot now; however there is a real danger of over-estimating your physical drives and running yourself ragged. You may act territorially and aggressively towards others and experience intense power struggles. There is also a danger of accidents or injuries."
  },
  {
    "start": "3 September 2026",
    "end": "13 September 2026",
    "strongest": "8 September 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Neptune",
    "description": "Your inner and spiritual life is enhanced now; more so than at just about any other time. You have a great wealth of feeling and compassion, coupled with a deep and sincere desire to look after or help those in need. Your interest in metaphysical subjects is likely to grow now and you may experience unusual insights. If you are in any way musical, artistic or creative, you can expect your powers of inspiration and imagination to get a boost now. Travel under this influence is usually beneficial."
  },
  {
    "start": "4 September 2026",
    "end": "5 September 2026",
    "strongest": "4 September 2026",
    "aspect": "Transiting Mercury is Square your Natal Mercury",
    "description": "Communicating with others may be difficult or irritating now; they are likely to challenge your views and opinions. Also, avoid making important decisions, if possible. There can be transport problems too."
  },
  {
    "start": "4 September 2026",
    "end": "7 September 2026",
    "strongest": "5 September 2026",
    "aspect": "Transiting Mars is Trine your Natal Venus",
    "description": "This is a good time for making social contacts or entertaining. You have the energy and enthusiasm for socialising. Creative activity or romance is well-aspected now."
  },
  {
    "start": "6 September 2026",
    "end": "16 September 2026",
    "strongest": "11 September 2026",
    "aspect": "Transiting Jupiter is Sextile your Natal Pluto",
    "description": "This is the \"positive use of power\" transit. You may find yourself, at this time, demonstrating that you have what it takes to encourage people to follow your lead. And they will, providing your intentions are for the common good. The secret to getting things done together with others is for you to lead by example, yet to remain one of the guys. However, should you set yourself apart from others, you will only end up feeling alienated. A person that you respect or who holds power may take a shine to you now."
  },
  {
    "start": "9 September 2026",
    "end": "12 September 2026",
    "strongest": "10 September 2026",
    "aspect": "Transiting Venus is Sextile your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "9 September 2026",
    "end": "19 September 2026",
    "strongest": "14 September 2026",
    "aspect": "Transiting Jupiter is Square your Natal Venus",
    "description": "Matters of the heart feature strongly now. You may become the object of someone's romantic desires, or you, in turn, could be smitten with another. Established relationships, too, can go through a period of increased warmth and affection. Alternatively, romance may not feature at all at this time; instead your life becomes a whirl of social engagements or pleasure seeking activities. You may be inclined to indulge yourself and over-spend on such things as luxury items, fine clothes or beauty products. If you are artistically inclined, this can be a successful creative period for you, with your work being acknowledged and respected by others. Travel for enjoyment and pleasure is favoured now, if affordable. Less positively, arguments caused by exaggerated expectations, negligence or differences of opinion can mar relationships. There can be conflicts in love."
  },
  {
    "start": "10 September 2026",
    "end": "11 September 2026",
    "strongest": "10 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Ascendant",
    "description": "Communications with others should go well now. You can take part in important discussions or small talk with equal skill."
  },
  {
    "start": "10 September 2026",
    "end": "11 September 2026",
    "strongest": "11 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Sun",
    "description": "Anticipate an intellectually stimulating interval, with all sorts of people trying to get in touch with you. A good time for doing mental work and for catching up on outstanding paperwork."
  },
  {
    "start": "11 September 2026",
    "end": "11 September 2026",
    "strongest": "11 September 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "12 September 2026",
    "end": "13 September 2026",
    "strongest": "12 September 2026",
    "aspect": "Transiting Mercury is Trine Transiting Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Sharp thinking and keen judgement. A critical mind. The power of persuasion."
  },
  {
    "start": "12 September 2026",
    "end": "13 September 2026",
    "strongest": "12 September 2026",
    "aspect": "Transiting Mercury is Opposition Transiting Neptune",
    "description": "The use of imagination. Thinking one thing and saying another. Misinterpreting things. Being at risk from deception or misrepresentation of facts. Need guard to against being exposed to lies or misunderstandings. Miscommunications. Faulty judgement. Unrealistic ideas."
  },
  {
    "start": "12 September 2026",
    "end": "14 September 2026",
    "strongest": "13 September 2026",
    "aspect": "Transiting Mercury is Square your Natal Jupiter",
    "description": "This can be a good time for discussing important issues, as long as you keep everything in perspective and don't exaggerate or blow things out of proportion. Avoid hasty decisions."
  },
  {
    "start": "13 September 2026",
    "end": "14 September 2026",
    "strongest": "14 September 2026",
    "aspect": "Transiting Mercury is Trine Transiting Uranus",
    "description": "Reliable intuition. Original ideas and flashes of inspiration can be expected. Demonstrating intellectual flexibility and lateral thinking. Keen powers of observation."
  },
  {
    "start": "14 September 2026",
    "end": "17 September 2026",
    "strongest": "15 September 2026",
    "aspect": "Transiting Venus is Square Transiting Pluto",
    "description": "At this time there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Amorous excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "15 September 2026",
    "end": "16 September 2026",
    "strongest": "16 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Mars",
    "description": "During this period, you are intellectually sharp and able to talk yourself into and out of just about anything now. You can get things done now if you put mind to it."
  },
  {
    "start": "15 September 2026",
    "end": "19 September 2026",
    "strongest": "17 September 2026",
    "aspect": "Transiting Venus is Opposition your Natal Moon",
    "description": "The only thing that might spoil this period is irritability - your own or another's. There may be friction in the home or family, or with women."
  },
  {
    "start": "16 September 2026",
    "end": "20 September 2026",
    "strongest": "18 September 2026",
    "aspect": "Transiting Venus is Trine your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "17 September 2026",
    "end": "19 September 2026",
    "strongest": "18 September 2026",
    "aspect": "Transiting Mercury is Opposition Transiting Saturn",
    "description": "Serious and realistic thinking applies now, which at its best is practical, but at its worst, narrow and pessimistic. There can be miscommunications during this planetary influence, or transport problems and delays."
  },
  {
    "start": "19 September 2026",
    "end": "20 September 2026",
    "strongest": "20 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Neptune",
    "description": "A somewhat dreamy and romantic mood influences your thinking at the moment. You are at risk of being mentally lax and careless now, but equally, there is the possibility of inspired and imaginative thinking too. Music, poetry, film and artistic creativity can flourish during this transit."
  },
  {
    "start": "19 September 2026",
    "end": "21 September 2026",
    "strongest": "20 September 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Pluto",
    "description": "Your thoughts tend to be influenced by deep emotional stirrings now. Your powers of persuasion are very strong and you should be able to convince just about anybody of anything at the present time. This is a good time to carry out research."
  },
  {
    "start": "21 September 2026",
    "end": "22 September 2026",
    "strongest": "21 September 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "22 September 2026",
    "end": "23 September 2026",
    "strongest": "23 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Mercury",
    "description": "This is an excellent time for all types of communication. You can present your ideas or arguments well now. Business decisions and short distance travel are well-aspected."
  },
  {
    "start": "26 September 2026",
    "end": "7 October 2026",
    "strongest": "2 October 2026",
    "aspect": "Transiting Jupiter is Trine your Natal Mercury",
    "description": "Your thinking will be positive and optimistic. It is an excellent time for making long-term plans and decisions. Business matters should go well, because your ability to negotiate with others is easier now than at other times. Also, buying and selling, in any capacity, are well-aspected. Short trips or long-distance travel tend be relatively free of difficulties and international contacts can be successfully established. It is also an excellent time to smooth over any communication difficulties you may have with others. This could be a good time to change jobs or apply for a new job, especially in areas related to communication, computing, language, commerce or law."
  },
  {
    "start": "26 September 2026",
    "end": "26 September 2026",
    "strongest": "26 September 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "27 September 2026",
    "end": "30 September 2026",
    "strongest": "28 September 2026",
    "aspect": "Transiting Mars is Trine your Natal Ascendant",
    "description": "During this period, you can assert yourself more easily, without offending or upsetting others in the process. At this time, you are more direct and sure of yourself and people know what to expect of you. If you have leadership ability it is likely to be expressed in some way now."
  },
  {
    "start": "27 September 2026",
    "end": "1 October 2026",
    "strongest": "29 September 2026",
    "aspect": "Transiting Mars is Trine your Natal Sun",
    "description": "Your energies are strong and positive now. This is a good time to set goals, as you can achieve them. You have the drive, determination and motivation to get things done."
  },
  {
    "start": "29 September 2026",
    "end": "6 October 2026",
    "strongest": "29 September 2026",
    "aspect": "Transiting Venus is Square your Natal Mars",
    "description": "Your emotions are likely to run hot and cold during this period, which may cause people to wonder what to expect from one moment to the next. There is a potential for arguments and disagreements. Romantically, you may be inclined to come on too strongly and aggressively."
  },
  {
    "start": "29 September 2026",
    "end": "1 October 2026",
    "strongest": "30 September 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Saturn",
    "description": "This is a good time for attending to practical matters. You are able to plan well and to make arrangements. Your thinking is considered and realistic."
  },
  {
    "start": "1 October 2026",
    "end": "3 October 2026",
    "strongest": "2 October 2026",
    "aspect": "Transiting Mercury is Square Transiting Mars",
    "description": "Sudden arguments are likely to flare up. A tendency to speak ill of others. Decisions made in haste leading to problems later on. Impulsive thinking. Rash conclusions. Biting criticism. Aggressiveness. Negative thoughts. Accident proneness. Transport problems."
  },
  {
    "start": "1 October 2026",
    "end": "4 October 2026",
    "strongest": "2 October 2026",
    "aspect": "Transiting Mars is Trine Transiting Neptune",
    "description": "Physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. It may be a good time to go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "1 October 2026",
    "end": "5 October 2026",
    "strongest": "3 October 2026",
    "aspect": "Transiting Mars is Opposition Transiting Pluto",
    "description": "Powerful drives. Extreme efforts. The desire to dominate or to rule. The urge to change things, to eliminate and purify. High energy output. Negatively, there can be the tendency to act ruthlessly or brutally. Power struggles. Obsessions. Violence. Danger of accidents and injuries."
  },
  {
    "start": "2 October 2026",
    "end": "3 October 2026",
    "strongest": "2 October 2026",
    "aspect": "Transiting Mercury is Square Transiting Pluto",
    "description": "Intellectual powers and comprehension are as sharp as a tack during this period and the capability to exercise an influence over others through persuasive speaking or writing is accentuated. However, expressing extremist or fanatical opinions will tend to turn people off. Mental troubles. Paranoia. Cunning and craft."
  },
  {
    "start": "2 October 2026",
    "end": "4 October 2026",
    "strongest": "3 October 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Moon",
    "description": "Reason and emotion may be at odds with each other at the moment and communications with others, especially females or family members, could be tense. Try and be up-front with people, as this can help to avoid misunderstandings."
  },
  {
    "start": "3 October 2026",
    "end": "4 October 2026",
    "strongest": "4 October 2026",
    "aspect": "Transiting Mercury is Trine your Natal Jupiter",
    "description": "Positive thinking makes anything possible now. This is a good transit for communicating your ideas to others, making decisions and undertaking short journeys."
  },
  {
    "start": "3 October 2026",
    "end": "7 October 2026",
    "strongest": "5 October 2026",
    "aspect": "Transiting Mars is Square your Natal Moon",
    "description": "You, or someone in your environment, may be more moody or irritable than usual now. The smallest thing can set off an emotional reaction. Tread carefully and be aware of the feelings of those around you, especially family members. There is a risk of accident proneness now."
  },
  {
    "start": "5 October 2026",
    "end": "9 October 2026",
    "strongest": "7 October 2026",
    "aspect": "Transiting Mars is Sextile Transiting Uranus",
    "description": "The urge to try something new or out the ordinary. Increased courage to experiment or to introduce reforms. The power to make changes. Acting independently. Quick reflexes."
  },
  {
    "start": "6 October 2026",
    "end": "7 October 2026",
    "strongest": "7 October 2026",
    "aspect": "Transiting Mercury is Conjunct Transiting Venus",
    "description": "Light-heartedness and a desire for fun and entertainment. Communications with friends, loved ones and even strangers have a natural flow to them over this period. A courteous and pleasant manner can win friends and influence people. This can be a good time for socialising, or for discussing matters of the heart, or art."
  },
  {
    "start": "7 October 2026",
    "end": "8 October 2026",
    "strongest": "7 October 2026",
    "aspect": "Transiting Mercury is Square your Natal Mars",
    "description": "This planetary pairing speeds up your life. Your mind is razor sharp and your powers of comprehension are second to none now. However, if you're in too much of a rush to get things done, you risk making mistakes and wrong decisions. Sudden arguments are likely to flare up."
  },
  {
    "start": "9 October 2026",
    "end": "12 October 2026",
    "strongest": "10 October 2026",
    "aspect": "Transiting Venus is Square Transiting Mars",
    "description": "During this period passions run hot and feelings between people are intense and unpredictable. Tendency to come on too strongly in love or sex. Infidelity. Acts of violence are possible due to heated emotions. (A love of war-like activity)."
  },
  {
    "start": "10 October 2026",
    "end": "12 October 2026",
    "strongest": "11 October 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Uranus",
    "description": "During this period, your thinking is original and innovative, perhaps even revolutionary. Expect sudden intuitions or possible flashes of brilliance. A sudden change of outlook is possible. Plans may have to be altered."
  },
  {
    "start": "10 October 2026",
    "end": "10 October 2026",
    "strongest": "10 October 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "11 October 2026",
    "end": "13 October 2026",
    "strongest": "12 October 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "12 October 2026",
    "end": "16 October 2026",
    "strongest": "14 October 2026",
    "aspect": "Transiting Mars is Conjunct your Natal Mars",
    "description": "The spirit of enterprise is in you now. Set your sights on what you want and go for it. You have more drive than usual; however you will need to control any excess energy, as there is a risk of injury and accident proneness."
  },
  {
    "start": "13 October 2026",
    "end": "16 October 2026",
    "strongest": "15 October 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Venus",
    "description": "Your thinking is more likely than not to be on love and romance, or play. You have an eye for beauty and harmony, plus a sense for artistic creativity now. Social interaction and communication with others is easy under this influence."
  },
  {
    "start": "14 October 2026",
    "end": "17 October 2026",
    "strongest": "16 October 2026",
    "aspect": "Transiting Mars is Trine Transiting Saturn",
    "description": "Being unfazed by hard work and long hours. Disciplined action and energy. The ability to carry a task or project through to a successful conclusion. Willpower and determination. The power of endurance."
  },
  {
    "start": "15 October 2026",
    "end": "19 October 2026",
    "strongest": "17 October 2026",
    "aspect": "Transiting Venus is Trine your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "16 October 2026",
    "end": "20 October 2026",
    "strongest": "18 October 2026",
    "aspect": "Transiting Venus is Opposition your Natal Moon",
    "description": "The only thing that might spoil this period is irritability - your own or another's. There may be friction in the home or family, or with women."
  },
  {
    "start": "18 October 2026",
    "end": "22 November 2026",
    "strongest": "1 November 2026",
    "aspect": "Transiting Saturn is Trine your Natal Mars",
    "description": "You now have the self-discipline and determination to tackle those tasks you've had simmering on the backburner for some time. Your powers of perseverance and endurance are stronger and you will be able to accomplish a lot."
  },
  {
    "start": "18 October 2026",
    "end": "21 October 2026",
    "strongest": "20 October 2026",
    "aspect": "Transiting Venus is Square Transiting Pluto",
    "description": "At this time there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Amorous excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "19 October 2026",
    "end": "23 October 2026",
    "strongest": "21 October 2026",
    "aspect": "Transiting Mars is Square your Natal Uranus",
    "description": "Expect pressures and potential arguments caused by inner tensions or stress in either yourself or others. There is a danger of accidents or injuries during this period."
  },
  {
    "start": "23 October 2026",
    "end": "26 October 2026",
    "strongest": "24 October 2026",
    "aspect": "Transiting Venus is Sextile your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "23 October 2026",
    "end": "27 October 2026",
    "strongest": "25 October 2026",
    "aspect": "Transiting Mars is Trine your Natal Neptune",
    "description": "Your physical and competitive drives are more subdued and relaxed at the moment. This is an excellent period to take some time out in quiet and tranquil surroundings. Spend some time in reflection, go to a spiritual retreat, fishing lodge or similar."
  },
  {
    "start": "24 October 2026",
    "end": "28 October 2026",
    "strongest": "26 October 2026",
    "aspect": "Transiting Mars is Sextile your Natal Pluto",
    "description": "During this transit, you may dare to transform something about yourself; your appearance, personal surroundings or your relationship with another or group of people. You can achieve results now through perseverance and persistence."
  },
  {
    "start": "25 October 2026",
    "end": "29 October 2026",
    "strongest": "27 October 2026",
    "aspect": "Transiting Mars is Square your Natal Venus",
    "description": "This transit can bring about an intensification of passion and romantic fervour in you, which may or may not be reciprocated by another. Alternatively, the ardour of another could be directed at you. There may be arguments and disputes with loved ones caused by a lack of consideration or tactlessness. Selfishness in love is possible."
  },
  {
    "start": "26 October 2026",
    "end": "26 October 2026",
    "strongest": "26 October 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "30 October 2026",
    "end": "31 October 2026",
    "strongest": "30 October 2026",
    "aspect": "Transiting Mercury is Square Transiting Mars",
    "description": "Sudden arguments are likely to flare up. A tendency to speak ill of others. Decisions made in haste leading to problems later on. Impulsive thinking. Rash conclusions. Biting criticism. Aggressiveness. Negative thoughts. Accident proneness. Transport problems."
  },
  {
    "start": "31 October 2026",
    "end": "2 November 2026",
    "strongest": "1 November 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Venus",
    "description": "Your thinking is more likely than not to be on love and romance, or play. You have an eye for beauty and harmony, plus a sense for artistic creativity now. Social interaction and communication with others is easy under this influence."
  },
  {
    "start": "1 November 2026",
    "end": "5 November 2026",
    "strongest": "3 November 2026",
    "aspect": "Transiting Mars is Trine your Natal Mercury",
    "description": "This is an excellent time for getting your views and opinions and thoughts across to others. Intellectually, you are sharp and have the ability to comprehend things quickly."
  },
  {
    "start": "2 November 2026",
    "end": "3 November 2026",
    "strongest": "2 November 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "2 November 2026",
    "end": "6 November 2026",
    "strongest": "4 November 2026",
    "aspect": "Transiting Venus is Sextile Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "2 November 2026",
    "end": "4 November 2026",
    "strongest": "3 November 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Uranus",
    "description": "During this period, your thinking is original and innovative, perhaps even revolutionary. Expect sudden intuitions or possible flashes of brilliance. A sudden change of outlook is possible. Plans may have to be altered."
  },
  {
    "start": "6 November 2026",
    "end": "7 November 2026",
    "strongest": "6 November 2026",
    "aspect": "Transiting Mercury is Square your Natal Mars",
    "description": "This planetary pairing speeds up your life. Your mind is razor sharp and your powers of comprehension are second to none now. However, if you're in too much of a rush to get things done, you risk making mistakes and wrong decisions. Sudden arguments are likely to flare up."
  },
  {
    "start": "8 November 2026",
    "end": "11 November 2026",
    "strongest": "10 November 2026",
    "aspect": "Transiting Venus is Sextile Transiting Mars",
    "description": "Being in the mood for fun. Social spontaneity pays off. A romantic attraction is possible. Desire for love. Artistic creativity possible."
  },
  {
    "start": "9 November 2026",
    "end": "9 November 2026",
    "strongest": "9 November 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "10 November 2026",
    "end": "31 Dec 2026",
    "strongest": "10 November 2026",
    "aspect": "Transiting Neptune is Trine your Natal Sun",
    "description": "During this period, you will strive to know more about yourself as a spiritual and creative being. This is an excellent time for meditation and reflection, because you can receive profound insights about yourself and life in general. Also, if you are in anyway artistically inclined, your powers of imagination and inspiration are accentuated now. Long distance travel may also occur under this influence and be highly stimulating and inspiring, because you will be open to new impressions and sensations."
  },
  {
    "start": "11 November 2026",
    "end": "16 November 2026",
    "strongest": "11 November 2026",
    "aspect": "Transiting Mercury is Trine your Natal Jupiter",
    "description": "Positive thinking makes anything possible now. This is a good transit for communicating your ideas to others, making decisions and undertaking short journeys."
  },
  {
    "start": "11 November 2026",
    "end": "31 Dec 2026",
    "strongest": "28 December 2026",
    "aspect": "Transiting Pluto is Square your Natal Moon",
    "description": "During this transit, you will be subjected to intense emotional pressure, either through the surfacing of deep-seated feelings associated with your past, or through the influence of another whose presence causes you emotional turmoil in some way. Possibly, emotional, family or domestic circumstances will undergo transformation and upheaval. In certain cases, this may be a time for re-locating or changing residence. An influential woman in your life can have a profound effect on you at this time. There is the potential for emotionally charged power struggles, coupled with issues of emotional control and dominance. Emotional relationships, in particular, can come under pressure now, and those that are already shaky can break up completely. Positively, this transit can enable you to clear out or purge any aspects of your emotional life that limit or restrict you."
  },
  {
    "start": "12 November 2026",
    "end": "15 November 2026",
    "strongest": "12 November 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Moon",
    "description": "Reason and emotion may be at odds with each other at the moment and communications with others, especially females or family members, could be tense. Try and be up-front with people, as this can help to avoid misunderstandings."
  },
  {
    "start": "12 November 2026",
    "end": "15 December 2026",
    "strongest": "29 November 2026",
    "aspect": "Transiting Uranus is Trine Transiting Pluto",
    "description": "Reforms and innovations successfully introduced. Technological breakthroughs and advancements. Mass technology. Sense of purpose. Urge to liberate and be liberated. Bringing the new into being."
  },
  {
    "start": "13 November 2026",
    "end": "19 November 2026",
    "strongest": "16 November 2026",
    "aspect": "Transiting Mars is Conjunct Transiting Jupiter",
    "description": "This is one of the best planetary influences for business activity. Negotiating and dealing with contractual matters succeed now. Acting with integrity and a sense of purpose. Successful physical or martial activity. The ability to settle disputes amicably. A sense of honour."
  },
  {
    "start": "20 November 2026",
    "end": "21 November 2026",
    "strongest": "21 November 2026",
    "aspect": "Transiting Mercury is Square your Natal Mars",
    "description": "This planetary pairing speeds up your life. Your mind is razor sharp and your powers of comprehension are second to none now. However, if you're in too much of a rush to get things done, you risk making mistakes and wrong decisions. Sudden arguments are likely to flare up."
  },
  {
    "start": "23 November 2026",
    "end": "25 November 2026",
    "strongest": "24 November 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Uranus",
    "description": "During this period, your thinking is original and innovative, perhaps even revolutionary. Expect sudden intuitions or possible flashes of brilliance. A sudden change of outlook is possible. Plans may have to be altered."
  },
  {
    "start": "24 November 2026",
    "end": "29 November 2026",
    "strongest": "26 November 2026",
    "aspect": "Transiting Mars is Conjunct your Natal Saturn",
    "description": "You can achieve a lot during this transit, but it will take more effort than usual to get results. There may be difficulties with authority figures - especially males. There is also the need to guard against accidents and injury proneness now."
  },
  {
    "start": "24 November 2026",
    "end": "26 November 2026",
    "strongest": "25 November 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Midheaven",
    "description": "You are intellectually switched on and full of ideas at the moment, especially as far as your direction in life is concerned. You may come to a decision that will affect your career or family life."
  },
  {
    "start": "24 November 2026",
    "end": "24 November 2026",
    "strongest": "24 November 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "24 November 2026",
    "end": "29 November 2026",
    "strongest": "27 November 2026",
    "aspect": "Transiting Mars is Square your Natal Ascendant",
    "description": "During this period, you will tend to be very action orientated and self-motivated. You can get a lot accomplished now. However, you have to be careful that you don't push others around in the process, as it is likely to cause friction."
  },
  {
    "start": "25 November 2026",
    "end": "30 November 2026",
    "strongest": "28 November 2026",
    "aspect": "Transiting Mars is Square your Natal Sun",
    "description": "You have a desire to achieve things now, coupled with the drive to succeed. Expect an energy boost, but guard against over-exerting yourself physically, as it could lead to stress and strain. There is a risk of injury-proneness or conflicts with others."
  },
  {
    "start": "26 November 2026",
    "end": "30 November 2026",
    "strongest": "28 November 2026",
    "aspect": "Transiting Venus is Sextile Transiting Jupiter",
    "description": "This can be a very pleasant and enjoyable period. Enjoy the moment. Social settings could lead to contacts with influential or significant people."
  },
  {
    "start": "26 November 2026",
    "end": "27 November 2026",
    "strongest": "27 November 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Venus",
    "description": "Your thinking is more likely than not to be on love and romance, or play. You have an eye for beauty and harmony, plus a sense for artistic creativity now. Social interaction and communication with others is easy under this influence."
  },
  {
    "start": "2 December 2026",
    "end": "7 December 2026",
    "strongest": "4 December 2026",
    "aspect": "Transiting Mars is Square Transiting Uranus",
    "description": "Expect pressures and potential arguments caused by inner tensions or stress. A danger exists from impulsive actions and accident proneness. Take care travelling or when around machinery and volatile materials. Quick anger and sudden aggression."
  },
  {
    "start": "3 December 2026",
    "end": "6 December 2026",
    "strongest": "4 December 2026",
    "aspect": "Transiting Venus is Sextile your Natal Saturn",
    "description": "This can be a good time to define or re-define responsibilities and boundary lines in important personal relationships. Taking a short break from another or others now can be refreshing."
  },
  {
    "start": "3 December 2026",
    "end": "4 December 2026",
    "strongest": "4 December 2026",
    "aspect": "Transiting Mercury is Square Transiting Jupiter",
    "description": "This can be a good time for making decisions or discussing important issues, as long as the prep work has been done beforehand. Difficulties through negligent or lazy thinking. Not keeping promises, or promising more than can be delivered. A need to avoid exaggerating or blowing things out of proportion."
  },
  {
    "start": "4 December 2026",
    "end": "10 December 2026",
    "strongest": "7 December 2026",
    "aspect": "Transiting Mars is Trine your Natal Moon",
    "description": "Allow your instincts to guide you in your actions during this period, and trust them when assessing the actions of others. This is a good time for doing things around the home or with your family."
  },
  {
    "start": "5 December 2026",
    "end": "7 December 2026",
    "strongest": "6 December 2026",
    "aspect": "Transiting Mercury is Square your Natal Saturn",
    "description": "Your thinking and decision making processes tend to be slower than usual during this period. Your mind is occupied with serious or important matters. There can be miscommunications with others or transport problems and delays now."
  },
  {
    "start": "5 December 2026",
    "end": "12 December 2026",
    "strongest": "8 December 2026",
    "aspect": "Transiting Mars is Sextile your Natal Jupiter",
    "description": "Other people are happy to co-operate with you over this period, because they can see your intentions are honourable. Business related matters, including personal transactions, are well-aspected now. Decide in your own mind what you want and go and get it."
  },
  {
    "start": "6 December 2026",
    "end": "7 December 2026",
    "strongest": "6 December 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Ascendant",
    "description": "Intellectually, you are quite sharp and alert now. You have strong views and opinions, which may contrast with others causing the likelihood of arguments or lively debates."
  },
  {
    "start": "6 December 2026",
    "end": "7 December 2026",
    "strongest": "6 December 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Sun",
    "description": "Intellectual work is well-aspected now. Your mind is active and creative. It is a good time to catch up with any personal correspondences or communications."
  },
  {
    "start": "6 December 2026",
    "end": "8 December 2026",
    "strongest": "7 December 2026",
    "aspect": "Transiting Mercury is Trine Transiting Neptune",
    "description": "A somewhat dreamy and romantic outlook. Power of presentiment. Inspired thinking. Artistic appreciation. Music, poetry, film and artistic creativity can flourish."
  },
  {
    "start": "7 December 2026",
    "end": "9 December 2026",
    "strongest": "8 December 2026",
    "aspect": "Transiting Mercury is Opposition Transiting Uranus",
    "description": "Expressing either original or eccentric ideas. May be difficulties appreciating another's point of view, due to rigid or inflexible thinking. Easy excitability and nervous tension. Breakdowns in communication or transport are possible."
  },
  {
    "start": "8 December 2026",
    "end": "9 December 2026",
    "strongest": "8 December 2026",
    "aspect": "Transiting Mercury is Sextile Transiting Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Sharp thinking and keen judgement. A critical mind. The power of persuasion."
  },
  {
    "start": "8 December 2026",
    "end": "11 December 2026",
    "strongest": "9 December 2026",
    "aspect": "Transiting Venus is Square Transiting Pluto",
    "description": "At this time there is a strong chance of being drawn to another as if by some kind of hidden force or compulsion, with a very real risk of sexual tension and obsession. Amorous excesses. Amoral behaviour. Scenes of jealousy. Power struggles in emotional life."
  },
  {
    "start": "8 December 2026",
    "end": "10 December 2026",
    "strongest": "9 December 2026",
    "aspect": "Transiting Mercury is Square Transiting Mars",
    "description": "Sudden arguments are likely to flare up. A tendency to speak ill of others. Decisions made in haste leading to problems later on. Impulsive thinking. Rash conclusions. Biting criticism. Aggressiveness. Negative thoughts. Accident proneness. Transport problems."
  },
  {
    "start": "9 December 2026",
    "end": "9 December 2026",
    "strongest": "9 December 2026",
    "aspect": "New Moon",
    "description": ""
  },
  {
    "start": "9 December 2026",
    "end": "11 December 2026",
    "strongest": "10 December 2026",
    "aspect": "Transiting Venus is Opposition your Natal Moon",
    "description": "The only thing that might spoil this period is irritability - your own or another's. There may be friction in the home or family, or with women."
  },
  {
    "start": "9 December 2026",
    "end": "12 December 2026",
    "strongest": "11 December 2026",
    "aspect": "Transiting Venus is Trine your Natal Jupiter",
    "description": "This can be a very pleasant and enjoyable transit. You are able to relax and gain respite from the pressures of modern living. Treat yourself or another to a small gift or outing; it will make you feel good. A social setting could bring you into contact with someone influential or significant."
  },
  {
    "start": "10 December 2026",
    "end": "14 December 2026",
    "strongest": "12 December 2026",
    "aspect": "Transiting Venus is Sextile Transiting Mars",
    "description": "Being in the mood for fun. Social spontaneity pays off. A romantic attraction is possible. Desire for love. Artistic creativity possible."
  },
  {
    "start": "10 December 2026",
    "end": "12 December 2026",
    "strongest": "11 December 2026",
    "aspect": "Transiting Mercury is Trine Transiting Saturn",
    "description": "This is an excellent time for setting up a time-in-motion study. Tedious tasks won't seem so tedious now. Concentration is good and thinking is practical and realistic."
  },
  {
    "start": "11 December 2026",
    "end": "13 December 2026",
    "strongest": "12 December 2026",
    "aspect": "Transiting Mercury is Trine your Natal Mars",
    "description": "During this period, you are intellectually sharp and able to talk yourself into and out of just about anything now. You can get things done now if you put mind to it."
  },
  {
    "start": "15 December 2026",
    "end": "16 December 2026",
    "strongest": "15 December 2026",
    "aspect": "Transiting Mercury is Square your Natal Midheaven",
    "description": "During this transit, your thoughts will simultaneously be on matters concerning your home and family and your career."
  },
  {
    "start": "15 December 2026",
    "end": "17 December 2026",
    "strongest": "16 December 2026",
    "aspect": "Transiting Venus is Square your Natal Mars",
    "description": "Your emotions are likely to run hot and cold during this period, which may cause people to wonder what to expect from one moment to the next. There is a potential for arguments and disagreements. Romantically, you may be inclined to come on too strongly and aggressively."
  },
  {
    "start": "15 December 2026",
    "end": "16 December 2026",
    "strongest": "16 December 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Neptune",
    "description": "There is no-one that can fool you like you can fool yourself during this transit. Guard against self-deception and misinterpreting the ideas and words of others. This is not your best time for making important decisions."
  },
  {
    "start": "16 December 2026",
    "end": "17 December 2026",
    "strongest": "16 December 2026",
    "aspect": "Transiting Mercury is Sextile your Natal Pluto",
    "description": "An excellent time for investigative work and for getting to the bottom of something. Release information on \"a need to know basis\" when dealing with others."
  },
  {
    "start": "18 December 2026",
    "end": "19 December 2026",
    "strongest": "19 December 2026",
    "aspect": "Transiting Mercury is Conjunct your Natal Mercury",
    "description": "This is a good time for making decisions and discussing issues of personal importance; however if transiting Mercury is going retrograde you need to exercise extra caution and circumspection before making important decisions. You are intellectually alert and bursting with new ideas at the moment."
  },
  {
    "start": "20 December 2026",
    "end": "22 December 2026",
    "strongest": "21 December 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Uranus",
    "description": "Expect the unexpected in love or friendship now. You may play the flirt, or be flirted with. A sudden attraction is possible, causing a smile to come to your face."
  },
  {
    "start": "21 December 2026",
    "end": "23 December 2026",
    "strongest": "22 December 2026",
    "aspect": "Transiting Venus is Sextile your Natal Midheaven",
    "description": "You are receptive to the finer things in life at the moment. If you are artistic, your creative powers may be enhanced now. Professional and domestic circumstances are harmonious now."
  },
  {
    "start": "21 December 2026",
    "end": "31 Dec 2026",
    "strongest": "21 December 2026",
    "aspect": "Transiting Uranus is Sextile Transiting Neptune",
    "description": "The tendency to turn attention inward and investigate spiritual matters. A longing for inner understanding and illumination. Scientific inspirations and breakthroughs. Social change. Rise in New Age thinking. Artistic inspiration. New directions and experimentation in art and music. New entertainment forms."
  },
  {
    "start": "23 December 2026",
    "end": "24 December 2026",
    "strongest": "23 December 2026",
    "aspect": "Transiting Mercury is Trine Transiting Jupiter",
    "description": "The power of positive thinking makes anything possible now. Being well-aspected for commercial activity, negotiation and settling contracts, providing the necessary groundwork has been done properly."
  },
  {
    "start": "23 December 2026",
    "end": "25 December 2026",
    "strongest": "24 December 2026",
    "aspect": "Transiting Venus is Conjunct your Natal Venus",
    "description": "A Venus return is usually a very pleasant experience. You feel content and life seems to take on an ease that is both attractive and enjoyable. You should try and fit in a social occasion now or, at least, spoil yourself or another."
  },
  {
    "start": "24 December 2026",
    "end": "24 December 2026",
    "strongest": "24 December 2026",
    "aspect": "Full Moon",
    "description": ""
  },
  {
    "start": "25 December 2026",
    "end": "26 December 2026",
    "strongest": "25 December 2026",
    "aspect": "Transiting Mercury is Trine your Natal Saturn",
    "description": "This is a good time for attending to practical matters. You are able to plan well and to make arrangements. Your thinking is considered and realistic."
  },
  {
    "start": "26 December 2026",
    "end": "27 December 2026",
    "strongest": "26 December 2026",
    "aspect": "Transiting Mercury is Square Transiting Neptune",
    "description": "The use of imagination. Thinking one thing and saying another. Misinterpreting things. Being at risk from deception or misrepresentation of facts. Need guard to against being exposed to lies or misunderstandings. Miscommunications. Faulty judgement. Unrealistic ideas."
  },
  {
    "start": "27 December 2026",
    "end": "29 December 2026",
    "strongest": "28 December 2026",
    "aspect": "Transiting Mercury is Trine your Natal Moon",
    "description": "You are more in touch with your own and others' feelings now. If you have anything on your mind you're unsure about, you should be able to find good listeners and advisers during this transit. This is a good decision making period."
  },
  {
    "start": "28 December 2026",
    "end": "29 December 2026",
    "strongest": "28 December 2026",
    "aspect": "Transiting Mercury is Opposition your Natal Jupiter",
    "description": "This can be a good time for discussing important issues, as long as you keep everything in perspective and don't exaggerate or blow things out of proportion. Avoid hasty decisions."
  },
  {
    "start": "29 December 2026",
    "end": "31 Dec 2026",
    "strongest": "29 December 2026",
    "aspect": "Transiting Saturn is Trine your Natal Mars",
    "description": "You now have the self-discipline and determination to tackle those tasks you've had simmering on the backburner for some time. Your powers of perseverance and endurance are stronger and you will be able to accomplish a lot."
  },
  {
    "start": "30 December 2026",
    "end": "31 Dec 2026",
    "strongest": "30 December 2026",
    "aspect": "Transiting Mercury is Square Transiting Saturn",
    "description": "Serious and realistic thinking applies now, which at its best is practical, but at its worst, narrow and pessimistic. There can be miscommunications during this planetary influence, or transport problems and delays."
  }
]
